igorhmc/yd-esp32-23/src/main.cpp
#include <Adafruit_NeoPixel.h>
#include <Arduino.h>
#include <new>
#include <ctype.h>
#include <ESPmDNS.h>
#include <esp_system.h>
#include <Preferences.h>
#include <Update.h>
#include <WebServer.h>
#include <WiFi.h>
#include "soc/soc_caps.h"

#if __has_include("wifi_secrets.h")
#include "wifi_secrets.h"
#endif

#ifndef WIFI_SSID
#define WIFI_SSID ""
#endif

#ifndef WIFI_PASSWORD
#define WIFI_PASSWORD ""
#endif

#ifndef DEVICE_HOSTNAME
#define DEVICE_HOSTNAME "esp32"
#endif

#ifndef MATRIX_OUTPUT_COUNT
#define MATRIX_OUTPUT_COUNT 2
#endif

#ifndef MATRIX_ACTIVE_OUTPUTS_DEFAULT
#define MATRIX_ACTIVE_OUTPUTS_DEFAULT 2
#endif

#ifndef MATRIX_MAX_OUTPUTS
#define MATRIX_MAX_OUTPUTS 8
#endif

#ifndef MATRIX_SEGMENT_WIDTH
#define MATRIX_SEGMENT_WIDTH 8
#endif

#ifndef MATRIX_HEIGHT
#define MATRIX_HEIGHT 8
#endif

#ifndef MATRIX_PIN_0
#define MATRIX_PIN_0 14
#endif

#ifndef MATRIX_PIN_1
#define MATRIX_PIN_1 17
#endif

#ifndef MATRIX_PIN_2
#define MATRIX_PIN_2 4
#endif

#ifndef MATRIX_PIN_3
#define MATRIX_PIN_3 5
#endif

#ifndef MATRIX_PIN_4
#define MATRIX_PIN_4 6
#endif

#ifndef MATRIX_PIN_5
#define MATRIX_PIN_5 7
#endif

#ifndef MATRIX_PIN_6
#define MATRIX_PIN_6 15
#endif

#ifndef MATRIX_PIN_7
#define MATRIX_PIN_7 16
#endif

#ifndef MATRIX_SERPENTINE
#define MATRIX_SERPENTINE 1
#endif

#ifndef MATRIX_X_FLIP
#define MATRIX_X_FLIP 1
#endif

#ifndef MATRIX_Y_FLIP
#define MATRIX_Y_FLIP 0
#endif

#ifndef MATRIX_SCAN_ORDER
#define MATRIX_SCAN_ORDER 1
#endif

#ifndef MATRIX_MAX_LEDS
#define MATRIX_MAX_LEDS 6720
#endif

#ifndef MATRIX_BRIGHTNESS_DEFAULT
#define MATRIX_BRIGHTNESS_DEFAULT 32
#endif

static const uint16_t kMatrixCompiledMaxLedCount = MATRIX_MAX_LEDS;
static const uint16_t kMatrixDefaultLedsPerOutput = MATRIX_SEGMENT_WIDTH * MATRIX_HEIGHT;
static const uint16_t kModuleLedCount64 = 64;
static const uint16_t kModuleLedCount256 = 256;

#ifdef LED_BUILTIN
static const int kLedPin = LED_BUILTIN;
#endif

namespace {

struct RgbPinList {
  int pins[4];
  size_t count;
};

struct RgbColor {
  uint8_t r;
  uint8_t g;
  uint8_t b;
};

enum class ScrollDirection : uint8_t {
  Left = 0,
  Right = 1,
};

enum class MatrixScanOrder : uint8_t {
  RowMajor = 0,
  ColumnMajor = 1,
};

WebServer gWebServer(80);
uint32_t *gMatrixBuffer[MATRIX_OUTPUT_COUNT] = {nullptr};
Adafruit_NeoPixel *gMatrixStrips[MATRIX_OUTPUT_COUNT] = {nullptr};
const uint8_t kMatrixDefaultPins[MATRIX_MAX_OUTPUTS] = {
  MATRIX_PIN_0,
  MATRIX_PIN_1,
  MATRIX_PIN_2,
  MATRIX_PIN_3,
  MATRIX_PIN_4,
  MATRIX_PIN_5,
  MATRIX_PIN_6,
  MATRIX_PIN_7,
};
static_assert(MATRIX_OUTPUT_COUNT <= MATRIX_MAX_OUTPUTS, "MATRIX_OUTPUT_COUNT exceeds MATRIX_MAX_OUTPUTS");
uint8_t gMatrixPins[MATRIX_OUTPUT_COUNT] = {0};
uint16_t gMatrixLedsPerOutput[MATRIX_OUTPUT_COUNT] = {0};
uint16_t gMatrixColsPerOutput[MATRIX_OUTPUT_COUNT] = {0};
uint16_t gMatrixXOffsets[MATRIX_OUTPUT_COUNT + 1] = {0};
uint16_t gMatrixTotalWidth = MATRIX_OUTPUT_COUNT * MATRIX_SEGMENT_WIDTH;
uint8_t gMatrixActiveOutputs =
  (MATRIX_ACTIVE_OUTPUTS_DEFAULT < 1)
    ? 1
    : ((MATRIX_ACTIVE_OUTPUTS_DEFAULT > MATRIX_OUTPUT_COUNT) ? MATRIX_OUTPUT_COUNT : MATRIX_ACTIVE_OUTPUTS_DEFAULT);

RgbColor gLedColor = {0, 0, 0};
int gMatrixDataPin = MATRIX_PIN_0;
uint16_t gMatrixActiveLedCount = 0;
uint16_t gMatrixRuntimeMaxLedCount = kMatrixCompiledMaxLedCount;
uint8_t gMatrixBrightness = MATRIX_BRIGHTNESS_DEFAULT;
bool gMatrixReady = false;
bool gMatrixTestRunning = false;
uint16_t gMatrixTestIndex = 0;
unsigned long gMatrixLastStepMs = 0;
bool gMatrixScrollRunning = false;
String gMatrixScrollText = "HELLO";
int16_t gMatrixScrollOffsetX = 0;
unsigned long gMatrixScrollLastStepMs = 0;
uint16_t gMatrixScrollStepMs = 120;
ScrollDirection gMatrixScrollDirection = ScrollDirection::Left;
MatrixScanOrder gMatrixScanOrder = (MATRIX_SCAN_ORDER == 0) ? MatrixScanOrder::RowMajor
                                                            : MatrixScanOrder::ColumnMajor;
bool gMatrixXFlip = (MATRIX_X_FLIP != 0);
bool gMatrixYFlip = (MATRIX_Y_FLIP != 0);

static const uint8_t kScrollFontHeight = 6;
static const uint8_t kScrollGlyphWidth = 5;
static const uint8_t kScrollGlyphSpacing = 1;
static const size_t kScrollTextMaxLength = 64;
uint32_t gMatrixScrollCharColors[kScrollTextMaxLength] = {0};
bool gMatrixScrollUseCharColors = false;

bool gMdnsStarted = false;
bool gWebServerStarted = false;
bool gApMode = false;
bool gOtaHasError = false;
String gApSsid;
String gApPassword;
bool gSafeMode = false;
String gSafeModeReason;
bool gBootMarkedStable = false;

RTC_DATA_ATTR uint32_t gBootGuardArmed = 0;
RTC_DATA_ATTR uint32_t gBootGuardAttempts = 0;
RTC_DATA_ATTR uint32_t gRecoveryBootToken = 0;
static const uint32_t kBootGuardMagic = 0xB007B007;
static const uint32_t kBootGuardThreshold = 3;
static const unsigned long kBootGuardStableMs = 30000;
static const uint32_t kRecoveryBootMagic = 0x5AFE1234;

void renderMatrixScrollFrame();
bool mapMatrixXY(uint16_t x, uint8_t y, uint8_t &output, uint16_t &index);

int getBuiltinRgbDataPin() {
#if defined(RGB_BUILTIN)
  if (RGB_BUILTIN >= SOC_GPIO_PIN_COUNT) {
    return RGB_BUILTIN - SOC_GPIO_PIN_COUNT;
  }
  return RGB_BUILTIN;
#else
  return -1;
#endif
}

void addUniquePin(RgbPinList &list, int pin) {
  if (pin < 0 || pin >= static_cast<int>(SOC_GPIO_PIN_COUNT)) {
    return;
  }
  for (size_t i = 0; i < list.count; i++) {
    if (list.pins[i] == pin) {
      return;
    }
  }
  if (list.count < (sizeof(list.pins) / sizeof(list.pins[0]))) {
    list.pins[list.count++] = pin;
  }
}

RgbPinList buildRgbPinList() {
  RgbPinList list = {{-1, -1, -1, -1}, 0};
  addUniquePin(list, getBuiltinRgbDataPin());
  addUniquePin(list, 48);
  addUniquePin(list, 38);
  return list;
}

void writeRgbAllPins(const RgbPinList &list, uint8_t r, uint8_t g, uint8_t b) {
  for (size_t i = 0; i < list.count; i++) {
    neopixelWrite(static_cast<uint8_t>(list.pins[i]), r, g, b);
  }
}

void applyBoardLedColor(const RgbColor &color) {
  // Avoid RMT conflicts when the WS2812 matrix is active.
  if (gMatrixReady) {
    return;
  }

  const RgbPinList rgbPins = buildRgbPinList();
  if (rgbPins.count > 0) {
    writeRgbAllPins(rgbPins, color.r, color.g, color.b);
    return;
  }

#ifdef LED_BUILTIN
  const bool on = (color.r > 0 || color.g > 0 || color.b > 0);
  digitalWrite(kLedPin, on ? HIGH : LOW);
#else
  (void)color;
#endif
}

uint32_t packColor(uint8_t r, uint8_t g, uint8_t b) {
  return (static_cast<uint32_t>(r) << 16) | (static_cast<uint32_t>(g) << 8) | b;
}

void clearMatrixBuffer() {
  for (uint8_t output = 0; output < gMatrixActiveOutputs; output++) {
    if (gMatrixBuffer[output] == nullptr) {
      continue;
    }
    for (uint16_t i = 0; i < gMatrixLedsPerOutput[output]; i++) {
      gMatrixBuffer[output][i] = 0;
    }
  }
}

