igorhmc/yd-esp32-23/src/main.cpp
void showMatrix() {
  for (uint8_t output = 0; output < gMatrixActiveOutputs; output++) {
    Adafruit_NeoPixel *strip = gMatrixStrips[output];
    if (strip == nullptr) {
      continue;
    }
    strip->setBrightness(gMatrixBrightness);
    if (gMatrixBuffer[output] == nullptr) {
      continue;
    }
    for (uint16_t i = 0; i < gMatrixLedsPerOutput[output]; i++) {
      strip->setPixelColor(i, gMatrixBuffer[output][i]);
    }
    strip->show();
  }
}

void applyMatrixSolidColor(const RgbColor &color) {
  if (!gMatrixReady) {
    return;
  }

  clearMatrixBuffer();

  const uint32_t packed = packColor(color.r, color.g, color.b);
  for (uint8_t output = 0; output < gMatrixActiveOutputs; output++) {
    if (gMatrixBuffer[output] == nullptr) {
      continue;
    }
    for (uint16_t i = 0; i < gMatrixLedsPerOutput[output]; i++) {
      gMatrixBuffer[output][i] = packed;
    }
  }
  showMatrix();
}

void setLedColor(uint8_t r, uint8_t g, uint8_t b) {
  gLedColor = {r, g, b};
  gMatrixTestRunning = false;
  applyBoardLedColor(gLedColor);
  if (gMatrixScrollRunning) {
    renderMatrixScrollFrame();
  } else {
    applyMatrixSolidColor(gLedColor);
  }
}

void setMatrixBrightness(uint8_t value) {
  gMatrixBrightness = value;
  if (gMatrixReady && !gMatrixTestRunning) {
    if (gMatrixScrollRunning) {
      renderMatrixScrollFrame();
    } else {
      applyMatrixSolidColor(gLedColor);
    }
  }
}

String ledHexColor() {
  char hex[8];
  snprintf(hex, sizeof(hex), "#%02X%02X%02X", gLedColor.r, gLedColor.g, gLedColor.b);
  return String(hex);
}

bool parseHexColor(String hex, RgbColor &out) {
  hex.trim();
  if (hex.startsWith("#")) {
    hex.remove(0, 1);
  }
  if (hex.length() != 6) {
    return false;
  }

  char *endPtr = nullptr;
  const unsigned long value = strtoul(hex.c_str(), &endPtr, 16);
  if (endPtr == nullptr || *endPtr != '\0') {
    return false;
  }

  out.r = static_cast<uint8_t>((value >> 16) & 0xFF);
  out.g = static_cast<uint8_t>((value >> 8) & 0xFF);
  out.b = static_cast<uint8_t>(value & 0xFF);
  return true;
}

const char *scrollDirectionToString(ScrollDirection direction) {
  return direction == ScrollDirection::Right ? "right" : "left";
}

const char *matrixScanOrderToString(MatrixScanOrder order) {
  return order == MatrixScanOrder::ColumnMajor ? "column" : "row";
}

bool parseScrollDirection(const String &value, ScrollDirection &out) {
  String dir = value;
  dir.trim();
  dir.toLowerCase();

  if (dir == "left" || dir == "rtl" || dir == "right_to_left") {
    out = ScrollDirection::Left;
    return true;
  }
  if (dir == "right" || dir == "ltr" || dir == "left_to_right") {
    out = ScrollDirection::Right;
    return true;
  }

  return false;
}

bool parseMatrixScanOrder(const String &value, MatrixScanOrder &out) {
  String scan = value;
  scan.trim();
  scan.toLowerCase();

  if (scan == "row" || scan == "rows" || scan == "row_major") {
    out = MatrixScanOrder::RowMajor;
    return true;
  }
  if (scan == "column" || scan == "columns" || scan == "col" || scan == "column_major") {
    out = MatrixScanOrder::ColumnMajor;
    return true;
  }

  return false;
}

bool parseBoolArg(const String &value, bool &out) {
  String v = value;
  v.trim();
  v.toLowerCase();

  if (v == "1" || v == "true" || v == "on" || v == "yes") {
    out = true;
    return true;
  }
  if (v == "0" || v == "false" || v == "off" || v == "no") {
    out = false;
    return true;
  }
  return false;
}

void applyMatrixFlips(bool xFlip, bool yFlip) {
  gMatrixXFlip = xFlip;
  gMatrixYFlip = yFlip;
  if (!gMatrixReady) {
    return;
  }

  if (gMatrixScrollRunning) {
    renderMatrixScrollFrame();
  } else {
    applyMatrixSolidColor(gLedColor);
  }
  Serial.printf("[OK] Matrix flip updated | x=%d | y=%d\n",
                gMatrixXFlip ? 1 : 0,
                gMatrixYFlip ? 1 : 0);
}

void applyMatrixScanOrder(MatrixScanOrder order) {
  gMatrixScanOrder = order;
  if (!gMatrixReady) {
    return;
  }

  if (gMatrixScrollRunning) {
    renderMatrixScrollFrame();
  } else {
    applyMatrixSolidColor(gLedColor);
  }
  Serial.printf("[OK] Matrix scan mapping set to %s-major\n", matrixScanOrderToString(order));
}

const char *resetReasonToString(esp_reset_reason_t reason) {
  switch (reason) {
    case ESP_RST_POWERON:
      return "power_on";
    case ESP_RST_SW:
      return "software";
    case ESP_RST_PANIC:
      return "panic";
    case ESP_RST_INT_WDT:
      return "interrupt_wdt";
    case ESP_RST_TASK_WDT:
      return "task_wdt";
    case ESP_RST_WDT:
      return "other_wdt";
    case ESP_RST_BROWNOUT:
      return "brownout";
    case ESP_RST_DEEPSLEEP:
      return "deepsleep";
    default:
      return "other";
  }
}

void armBootGuard() {
  if (gBootGuardArmed == kBootGuardMagic) {
    gBootGuardAttempts++;
  } else {
    gBootGuardAttempts = 1;
  }
  gBootGuardArmed = kBootGuardMagic;
}

void clearBootGuard() {
  gBootGuardArmed = 0;
  gBootGuardAttempts = 0;
}

String matrixPinsCsv() {
  String pins;
  for (uint8_t i = 0; i < gMatrixActiveOutputs; i++) {
    if (i > 0) {
      pins += ",";
    }
    pins += String(gMatrixPins[i]);
  }
  return pins;
}

String matrixCountsCsv() {
  String counts;
  for (uint8_t i = 0; i < gMatrixActiveOutputs; i++) {
    if (i > 0) {
      counts += ",";
    }
    counts += String(gMatrixLedsPerOutput[i]);
  }
  return counts;
}

uint16_t matrixWidth() {
  return gMatrixTotalWidth;
}

uint8_t clampActiveOutputs(int value) {
  if (value < 1) {
    return 1;
  }
  if (value > MATRIX_OUTPUT_COUNT) {
    return MATRIX_OUTPUT_COUNT;
  }
  return static_cast<uint8_t>(value);
}

bool isValidMatrixPin(int pin) {
  return pin >= 0 && pin < static_cast<int>(SOC_GPIO_PIN_COUNT);
}

void loadDefaultMatrixPins() {
  for (uint8_t i = 0; i < MATRIX_OUTPUT_COUNT; i++) {
    gMatrixPins[i] = kMatrixDefaultPins[i];
  }
  gMatrixDataPin = gMatrixPins[0];
}

void loadDefaultMatrixCounts() {
  for (uint8_t i = 0; i < MATRIX_OUTPUT_COUNT; i++) {
    gMatrixLedsPerOutput[i] = kMatrixDefaultLedsPerOutput;
  }
}

bool matrixCountsAreValid(const uint16_t counts[MATRIX_OUTPUT_COUNT],
                         uint8_t activeOutputs,
                         String &errorCode) {
  uint32_t total = 0;
  for (uint8_t i = 0; i < activeOutputs; i++) {
    const uint16_t count = counts[i];
    if (count == 0) {
      errorCode = "count_zero_not_allowed";
      return false;
    }
    if ((count % MATRIX_HEIGHT) != 0) {
      errorCode = "count_must_be_multiple_of_matrix_height";
      return false;
    }
    total += count;
  }

  if (total > gMatrixRuntimeMaxLedCount) {
    errorCode = "counts_exceed_runtime_limit";
    return false;
  }
  return true;
}

bool rebuildMatrixGeometry(const uint16_t counts[MATRIX_OUTPUT_COUNT],
                          uint8_t activeOutputs,
                          String &errorCode) {
  if (!matrixCountsAreValid(counts, activeOutputs, errorCode)) {
    return false;
  }

  uint16_t x = 0;
  uint32_t total = 0;
  gMatrixXOffsets[0] = 0;
  for (uint8_t i = 0; i < activeOutputs; i++) {
    gMatrixColsPerOutput[i] = static_cast<uint16_t>(counts[i] / MATRIX_HEIGHT);
    x = static_cast<uint16_t>(x + gMatrixColsPerOutput[i]);
    gMatrixXOffsets[i + 1] = x;
    total += counts[i];
  }
  for (uint8_t i = activeOutputs; i < MATRIX_OUTPUT_COUNT; i++) {
    gMatrixColsPerOutput[i] = 0;
    gMatrixXOffsets[i + 1] = x;
  }

  gMatrixTotalWidth = x;
  gMatrixActiveLedCount = static_cast<uint16_t>(total);
  return true;
}

bool parseMatrixCountsCsv(String csv,
                         uint8_t expectedCount,
                         uint16_t outCounts[MATRIX_OUTPUT_COUNT],
                         String &errorCode) {
  csv.trim();
  if (csv.length() == 0) {
    errorCode = "counts_empty";
    return false;
  }

  uint8_t count = 0;
  int start = 0;
  while (start <= csv.length()) {
    const int separator = csv.indexOf(',', start);
    String token = (separator < 0) ? csv.substring(start) : csv.substring(start, separator);
    token.trim();
    if (token.length() == 0) {
      errorCode = "invalid_counts_format";
      return false;
    }

    // Accept plain totals (e.g. 320) or module math per output (e.g. 1x64+2x256).
    uint32_t totalForOutput = 0;
    int termStart = 0;
    while (termStart <= token.length()) {
      const int plusPos = token.indexOf('+', termStart);
      String term = (plusPos < 0) ? token.substring(termStart) : token.substring(termStart, plusPos);
      term.trim();
      if (term.length() == 0) {
        errorCode = "invalid_count_value";
        return false;
      }

      const int xPosLower = term.indexOf('x');
      const int xPosUpper = term.indexOf('X');
      const int starPos = term.indexOf('*');
      int splitPos = xPosLower;
      if (splitPos < 0 || (xPosUpper >= 0 && xPosUpper < splitPos)) {
        splitPos = xPosUpper;
      }
      if (splitPos < 0 || (starPos >= 0 && starPos < splitPos)) {
        splitPos = starPos;
      }

      uint32_t termLeds = 0;
      if (splitPos >= 0) {
        String qtyText = term.substring(0, splitPos);
        String moduleText = term.substring(splitPos + 1);
        qtyText.trim();
        moduleText.trim();
        if (qtyText.length() == 0 || moduleText.length() == 0) {
          errorCode = "invalid_module_term";
          return false;
        }

        char *qtyEnd = nullptr;
        const long qty = strtol(qtyText.c_str(), &qtyEnd, 10);
        char *moduleEnd = nullptr;
        long moduleSize = strtol(moduleText.c_str(), &moduleEnd, 10);
        if (qtyEnd == qtyText.c_str() || qtyEnd == nullptr || *qtyEnd != '\0' || qty <= 0) {
          errorCode = "invalid_module_term";
          return false;
        }
        if (moduleEnd == moduleText.c_str() || moduleEnd == nullptr || *moduleEnd != '\0') {
          errorCode = "invalid_module_term";
          return false;
        }
        long moduleQty = qty;
        if (moduleSize != kModuleLedCount64 && moduleSize != kModuleLedCount256) {
          // Also accept reversed notation like 64x2 or 256*3.
          if ((qty == kModuleLedCount64 || qty == kModuleLedCount256) && moduleSize > 0) {
            moduleQty = moduleSize;
            moduleSize = qty;
          }
        }
        if (moduleSize != kModuleLedCount64 && moduleSize != kModuleLedCount256) {
          errorCode = "unsupported_module_size";
          return false;
        }
        termLeds = static_cast<uint32_t>(moduleQty) * static_cast<uint32_t>(moduleSize);
      } else {
        char *endPtr = nullptr;
        const long val = strtol(term.c_str(), &endPtr, 10);
        if (endPtr == term.c_str() || endPtr == nullptr || *endPtr != '\0') {
          errorCode = "invalid_count_value";
          return false;
        }
        if (val <= 0) {
          errorCode = "count_out_of_range";
          return false;
        }
        termLeds = static_cast<uint32_t>(val);
      }

