igorhmc/yd-esp32-23/src/main.cpp
      totalForOutput += termLeds;
      if (totalForOutput > 65535) {
        errorCode = "count_out_of_range";
        return false;
      }

      if (plusPos < 0) {
        break;
      }
      termStart = plusPos + 1;
    }

    if (totalForOutput == 0) {
      errorCode = "count_out_of_range";
      return false;
    }
    if (count >= expectedCount) {
      errorCode = "too_many_counts";
      return false;
    }

    outCounts[count++] = static_cast<uint16_t>(totalForOutput);

    if (separator < 0) {
      break;
    }
    start = separator + 1;
  }

  if (count != expectedCount) {
    errorCode = "counts_count_mismatch";
    return false;
  }
  return true;
}

bool matrixPinsAreUnique(const uint8_t pins[MATRIX_OUTPUT_COUNT], uint8_t activeOutputs) {
  for (uint8_t i = 0; i < activeOutputs; i++) {
    for (uint8_t j = i + 1; j < activeOutputs; j++) {
      if (pins[i] == pins[j]) {
        return false;
      }
    }
  }
  return true;
}

bool parseMatrixPinsCsv(String csv,
                       uint8_t expectedCount,
                       uint8_t outPins[MATRIX_OUTPUT_COUNT],
                       String &errorCode) {
  csv.trim();
  if (csv.length() == 0) {
    errorCode = "pins_empty";
    return false;
  }

  uint8_t count = 0;
  int start = 0;
  while (start <= csv.length()) {
    const int separator = csv.indexOf(',', start);
    String token = (separator < 0) ? csv.substring(start) : csv.substring(start, separator);
    token.trim();
    if (token.length() == 0) {
      errorCode = "invalid_pins_format";
      return false;
    }

    char *endPtr = nullptr;
    const long pin = strtol(token.c_str(), &endPtr, 10);
    if (endPtr == token.c_str() || endPtr == nullptr || *endPtr != '\0') {
      errorCode = "invalid_pin_value";
      return false;
    }
    if (!isValidMatrixPin(static_cast<int>(pin))) {
      errorCode = "pin_out_of_range";
      return false;
    }
    if (count >= expectedCount) {
      errorCode = "too_many_pins";
      return false;
    }

    outPins[count++] = static_cast<uint8_t>(pin);

    if (separator < 0) {
      break;
    }
    start = separator + 1;
  }

  if (count != expectedCount) {
    errorCode = "pins_count_mismatch";
    return false;
  }
  if (!matrixPinsAreUnique(outPins, expectedCount)) {
    errorCode = "duplicate_pins";
    return false;
  }
  return true;
}

uint16_t detectRuntimeMaxLedCount() {
  // WS2812 + internal strip buffer + frame buffer: ~7-8 bytes per LED.
  // Reserve heap for Wi-Fi/WebServer and compute a safe runtime ceiling.
  const uint32_t freeHeap = ESP.getFreeHeap();
  const uint32_t reservedHeap = 48 * 1024;
  const uint32_t minReasonable = gMatrixActiveOutputs * MATRIX_HEIGHT;

  if (freeHeap <= reservedHeap) {
    return static_cast<uint16_t>(minReasonable);
  }

  uint32_t byHeap = (freeHeap - reservedHeap) / 8;
  if (byHeap < minReasonable) {
    byHeap = minReasonable;
  }
  if (byHeap > kMatrixCompiledMaxLedCount) {
    byHeap = kMatrixCompiledMaxLedCount;
  }
  return static_cast<uint16_t>(byHeap);
}

void saveSettings() {
  Preferences pref;
  if (!pref.begin("ledcfg", false)) {
    return;
  }
  pref.putUChar("r", gLedColor.r);
  pref.putUChar("g", gLedColor.g);
  pref.putUChar("b", gLedColor.b);
  pref.putUChar("br", gMatrixBrightness);
  pref.putInt("mpin", gMatrixDataPin);
  pref.putUChar("mout", gMatrixActiveOutputs);
  pref.putUChar("mscan", static_cast<uint8_t>(gMatrixScanOrder));
  pref.putUChar("mxf", gMatrixXFlip ? 1 : 0);
  pref.putUChar("myf", gMatrixYFlip ? 1 : 0);
  for (uint8_t i = 0; i < MATRIX_OUTPUT_COUNT; i++) {
    char pinKey[6];
    char countKey[6];
    snprintf(pinKey, sizeof(pinKey), "mp%u", static_cast<unsigned>(i));
    snprintf(countKey, sizeof(countKey), "mc%u", static_cast<unsigned>(i));
    pref.putUChar(pinKey, gMatrixPins[i]);
    pref.putUShort(countKey, gMatrixLedsPerOutput[i]);
  }
  pref.putUShort("mcount", gMatrixActiveLedCount);
  pref.putUChar("msdir", static_cast<uint8_t>(gMatrixScrollDirection));
  pref.end();
}

void loadSettings() {
  loadDefaultMatrixPins();
  loadDefaultMatrixCounts();

  Preferences pref;
  if (!pref.begin("ledcfg", true)) {
    return;
  }

  const uint8_t r = pref.getUChar("r", 0);
  const uint8_t g = pref.getUChar("g", 0);
  const uint8_t b = pref.getUChar("b", 0);
  const uint8_t br = pref.getUChar("br", MATRIX_BRIGHTNESS_DEFAULT);
  const uint8_t activeOutputsRaw = pref.getUChar("mout", gMatrixActiveOutputs);
  const uint16_t legacyTotalCount = pref.getUShort("mcount", 0);
  const uint8_t scrollDirRaw = pref.getUChar("msdir", static_cast<uint8_t>(ScrollDirection::Left));
  const uint8_t scanRaw = pref.getUChar("mscan", static_cast<uint8_t>(gMatrixScanOrder));
  const uint8_t xFlipRaw = pref.getUChar("mxf", gMatrixXFlip ? 1 : 0);
  const uint8_t yFlipRaw = pref.getUChar("myf", gMatrixYFlip ? 1 : 0);

  gMatrixActiveOutputs = clampActiveOutputs(static_cast<int>(activeOutputsRaw));
  gMatrixRuntimeMaxLedCount = detectRuntimeMaxLedCount();

  bool hasAnyPerOutputCount = false;
  for (uint8_t i = 0; i < MATRIX_OUTPUT_COUNT; i++) {
    char pinKey[6];
    char countKey[6];
    snprintf(pinKey, sizeof(pinKey), "mp%u", static_cast<unsigned>(i));
    snprintf(countKey, sizeof(countKey), "mc%u", static_cast<unsigned>(i));

    int loadedPin = kMatrixDefaultPins[i];
    if (pref.isKey(pinKey)) {
      loadedPin = static_cast<int>(pref.getUChar(pinKey, static_cast<uint8_t>(kMatrixDefaultPins[i])));
    } else if (i == 0) {
      loadedPin = pref.getInt("mpin", kMatrixDefaultPins[0]);
    }

    if (isValidMatrixPin(loadedPin)) {
      gMatrixPins[i] = static_cast<uint8_t>(loadedPin);
    }

    if (pref.isKey(countKey)) {
      const uint16_t loadedCount = pref.getUShort(countKey, kMatrixDefaultLedsPerOutput);
      gMatrixLedsPerOutput[i] = loadedCount;
      hasAnyPerOutputCount = true;
    }
  }

  if (!hasAnyPerOutputCount && legacyTotalCount > 0) {
    if ((legacyTotalCount % gMatrixActiveOutputs) == 0) {
      const uint16_t each = static_cast<uint16_t>(legacyTotalCount / gMatrixActiveOutputs);
      if ((each % MATRIX_HEIGHT) == 0) {
        for (uint8_t i = 0; i < gMatrixActiveOutputs; i++) {
          gMatrixLedsPerOutput[i] = each;
        }
      }
    }
  }
  pref.end();

  if (!matrixPinsAreUnique(gMatrixPins, gMatrixActiveOutputs)) {
    loadDefaultMatrixPins();
  } else {
    gMatrixDataPin = gMatrixPins[0];
  }

  String geometryError;
  if (!rebuildMatrixGeometry(gMatrixLedsPerOutput, gMatrixActiveOutputs, geometryError)) {
    loadDefaultMatrixCounts();
    if (!rebuildMatrixGeometry(gMatrixLedsPerOutput, gMatrixActiveOutputs, geometryError)) {
      gMatrixActiveLedCount = gMatrixActiveOutputs * MATRIX_HEIGHT;
      gMatrixTotalWidth = gMatrixActiveOutputs;
    }
  }

