igorhmc/yd-esp32-23/src/main.cpp
  gMatrixBrightness = br;
  gMatrixScrollDirection = (scrollDirRaw == static_cast<uint8_t>(ScrollDirection::Right))
                             ? ScrollDirection::Right
                             : ScrollDirection::Left;
  gMatrixScanOrder = (scanRaw == static_cast<uint8_t>(MatrixScanOrder::RowMajor))
                       ? MatrixScanOrder::RowMajor
                       : MatrixScanOrder::ColumnMajor;
  gMatrixXFlip = (xFlipRaw != 0);
  gMatrixYFlip = (yFlipRaw != 0);
  setLedColor(r, g, b);
}

String jsonEscape(const String &value) {
  String out;
  out.reserve(value.length() + 8);
  for (size_t i = 0; i < value.length(); i++) {
    const char c = value.charAt(i);
    switch (c) {
      case '"':
        out += "\\\"";
        break;
      case '\\':
        out += "\\\\";
        break;
      case '\n':
        out += "\\n";
        break;
      case '\r':
        out += "\\r";
        break;
      case '\t':
        out += "\\t";
        break;
      default:
        out += c;
        break;
    }
  }
  return out;
}

void loadWifiSettings(String &ssid, String &password) {
  ssid = "";
  password = "";

  Preferences pref;
  if (!pref.begin("wifi", true)) {
    return;
  }
  ssid = pref.getString("ssid", "");
  password = pref.getString("pass", "");
  pref.end();
}

void saveWifiSettings(const String &ssid, const String &password) {
  Preferences pref;
  if (!pref.begin("wifi", false)) {
    return;
  }
  pref.putString("ssid", ssid);
  pref.putString("pass", password);
  pref.end();
}

void clearWifiSettings() {
  Preferences pref;
  if (!pref.begin("wifi", false)) {
    return;
  }
  pref.remove("ssid");
  pref.remove("pass");
  pref.end();
}

bool connectWifiWithCredentials(const String &ssid, const String &password, unsigned long timeoutMs = 15000) {
  if (ssid.length() == 0) {
    return false;
  }

  Serial.printf("Connecting to Wi-Fi: %s\n", ssid.c_str());
  WiFi.mode(gApMode ? WIFI_AP_STA : WIFI_STA);
  WiFi.setAutoReconnect(true);
  WiFi.persistent(false);
  WiFi.begin(ssid.c_str(), password.c_str());

  const unsigned long start = millis();
  while (WiFi.status() != WL_CONNECTED && (millis() - start) < timeoutMs) {
    delay(250);
    Serial.print('.');
  }
  Serial.println();

  if (WiFi.status() != WL_CONNECTED) {
    Serial.printf("[FAIL] Wi-Fi did not connect (status=%d)\n", static_cast<int>(WiFi.status()));
    return false;
  }

  Serial.println("[OK] Wi-Fi connected.");
  Serial.printf("SSID: %s\n", WiFi.SSID().c_str());
  Serial.printf("IP: %s\n", WiFi.localIP().toString().c_str());
  Serial.printf("RSSI: %d dBm\n", WiFi.RSSI());
  return true;
}

bool connectConfiguredWifi() {
  String storedSsid;
  String storedPassword;
  loadWifiSettings(storedSsid, storedPassword);

  if (storedSsid.length() > 0) {
    return connectWifiWithCredentials(storedSsid, storedPassword);
  }

  if (strlen(WIFI_SSID) == 0) {
    Serial.println("[INFO] Wi-Fi not configured (no saved credentials and empty WIFI_SSID).");
    return false;
  }

  return connectWifiWithCredentials(String(WIFI_SSID), String(WIFI_PASSWORD));
}

bool startConfigAp() {
  if (gApMode) {
    return true;
  }

  gApSsid = String(DEVICE_HOSTNAME) + "-setup";
  gApPassword = "12345678";

  WiFi.mode(WIFI_AP_STA);
  if (!WiFi.softAP(gApSsid.c_str(), gApPassword.c_str())) {
    Serial.println("[FAIL] Could not start configuration AP.");
    return false;
  }

  gApMode = true;
  Serial.printf("[OK] AP active: %s | password: %s | IP: %s\n",
                gApSsid.c_str(),
                gApPassword.c_str(),
                WiFi.softAPIP().toString().c_str());
  return true;
}

void stopConfigAp() {
  if (!gApMode) {
    return;
  }
  WiFi.softAPdisconnect(true);
  gApMode = false;
  Serial.println("[OK] Configuration AP stopped.");
}

uint32_t colorWheel(uint8_t pos) {
  pos = 255 - pos;
  if (pos < 85) {
    return packColor(255 - pos * 3, 0, pos * 3);
  }
  if (pos < 170) {
    pos -= 85;
    return packColor(0, pos * 3, 255 - pos * 3);
  }
  pos -= 170;
  return packColor(pos * 3, 255 - pos * 3, 0);
}

bool mapMatrixXY(uint16_t x, uint8_t y, uint8_t &output, uint16_t &index) {
  if (matrixWidth() == 0 || x >= matrixWidth() || y >= MATRIX_HEIGHT) {
    return false;
  }

  uint16_t mappedX = gMatrixXFlip ? (matrixWidth() - 1 - x) : x;
  const uint8_t mappedY = gMatrixYFlip ? (MATRIX_HEIGHT - 1 - y) : y;

  const uint32_t logical = static_cast<uint32_t>(mappedY) * matrixWidth() + mappedX;
  if (logical >= gMatrixActiveLedCount) {
    return false;
  }

  output = 0;
  while (output < gMatrixActiveOutputs && mappedX >= gMatrixXOffsets[output + 1]) {
    output++;
  }
  if (output >= gMatrixActiveOutputs) {
    return false;
  }

  uint16_t localX = static_cast<uint16_t>(mappedX - gMatrixXOffsets[output]);
  const uint16_t outputWidth = gMatrixColsPerOutput[output];
  if (outputWidth == 0 || localX >= outputWidth) {
    return false;
  }

  uint8_t localY = mappedY;
  if (gMatrixScanOrder == MatrixScanOrder::ColumnMajor) {
    if (MATRIX_SERPENTINE && ((localX & 0x01) != 0)) {
      localY = MATRIX_HEIGHT - 1 - localY;
    }
    index = static_cast<uint16_t>(localX) * MATRIX_HEIGHT + localY;
  } else {
    if (MATRIX_SERPENTINE && ((localY & 0x01) != 0)) {
      localX = outputWidth - 1 - localX;
    }
    index = static_cast<uint16_t>(localY) * outputWidth + localX;
  }
  return index < gMatrixLedsPerOutput[output];
}

void setMatrixPixel(uint16_t x, uint8_t y, uint32_t color) {
  uint8_t output = 0;
  uint16_t index = 0;
  if (mapMatrixXY(x, y, output, index)) {
    gMatrixBuffer[output][index] = color;
  }
}

bool loadGlyphRows(char c, uint8_t rows[kScrollFontHeight]) {
  memset(rows, 0, kScrollFontHeight);

  // 5x6 lowercase glyphs.
  switch (c) {
    case 'a': {
      const uint8_t data[kScrollFontHeight] = {0x00, 0x0E, 0x01, 0x0F, 0x11, 0x0F};
      memcpy(rows, data, kScrollFontHeight);
      return true;
    }
    case 'b': {
      const uint8_t data[kScrollFontHeight] = {0x10, 0x10, 0x1E, 0x11, 0x11, 0x1E};
      memcpy(rows, data, kScrollFontHeight);
      return true;
    }
    case 'c': {
      const uint8_t data[kScrollFontHeight] = {0x00, 0x0E, 0x11, 0x10, 0x11, 0x0E};
      memcpy(rows, data, kScrollFontHeight);
      return true;
    }
    case 'd': {
      const uint8_t data[kScrollFontHeight] = {0x01, 0x01, 0x0F, 0x11, 0x11, 0x0F};
      memcpy(rows, data, kScrollFontHeight);
      return true;
    }
    case 'e': {
      const uint8_t data[kScrollFontHeight] = {0x00, 0x0E, 0x11, 0x1F, 0x10, 0x0E};
      memcpy(rows, data, kScrollFontHeight);
      return true;
    }
    case 'f': {
      const uint8_t data[kScrollFontHeight] = {0x06, 0x08, 0x1E, 0x08, 0x08, 0x08};
      memcpy(rows, data, kScrollFontHeight);
      return true;
    }
    case 'g': {
      const uint8_t data[kScrollFontHeight] = {0x00, 0x0F, 0x11, 0x0F, 0x01, 0x0E};
      memcpy(rows, data, kScrollFontHeight);
      return true;
    }
    case 'h': {
      const uint8_t data[kScrollFontHeight] = {0x10, 0x10, 0x1E, 0x11, 0x11, 0x11};
      memcpy(rows, data, kScrollFontHeight);
      return true;
    }
    case 'i': {
      const uint8_t data[kScrollFontHeight] = {0x04, 0x00, 0x0C, 0x04, 0x04, 0x0E};
      memcpy(rows, data, kScrollFontHeight);
      return true;
    }
    case 'j': {
      const uint8_t data[kScrollFontHeight] = {0x02, 0x00, 0x02, 0x02, 0x12, 0x0C};
      memcpy(rows, data, kScrollFontHeight);
      return true;
    }
    case 'k': {
      const uint8_t data[kScrollFontHeight] = {0x10, 0x12, 0x14, 0x18, 0x14, 0x12};
      memcpy(rows, data, kScrollFontHeight);
      return true;
    }
    case 'l': {
      const uint8_t data[kScrollFontHeight] = {0x0C, 0x04, 0x04, 0x04, 0x04, 0x0E};
      memcpy(rows, data, kScrollFontHeight);
      return true;
    }
    case 'm': {
      const uint8_t data[kScrollFontHeight] = {0x00, 0x1A, 0x15, 0x15, 0x15, 0x15};
      memcpy(rows, data, kScrollFontHeight);
      return true;
    }
    case 'n': {
      const uint8_t data[kScrollFontHeight] = {0x00, 0x1E, 0x11, 0x11, 0x11, 0x11};
      memcpy(rows, data, kScrollFontHeight);
      return true;
    }
    case 'o': {
      const uint8_t data[kScrollFontHeight] = {0x00, 0x0E, 0x11, 0x11, 0x11, 0x0E};
      memcpy(rows, data, kScrollFontHeight);
      return true;
    }
    case 'p': {
      const uint8_t data[kScrollFontHeight] = {0x00, 0x1E, 0x11, 0x1E, 0x10, 0x10};
      memcpy(rows, data, kScrollFontHeight);
      return true;
    }
    case 'q': {
      const uint8_t data[kScrollFontHeight] = {0x00, 0x0F, 0x11, 0x0F, 0x01, 0x01};
      memcpy(rows, data, kScrollFontHeight);
      return true;
    }
    case 'r': {
      const uint8_t data[kScrollFontHeight] = {0x00, 0x16, 0x19, 0x10, 0x10, 0x10};
      memcpy(rows, data, kScrollFontHeight);
      return true;
    }
    case 's': {
      const uint8_t data[kScrollFontHeight] = {0x00, 0x0F, 0x10, 0x0E, 0x01, 0x1E};
      memcpy(rows, data, kScrollFontHeight);
      return true;
    }
    case 't': {
      const uint8_t data[kScrollFontHeight] = {0x08, 0x1E, 0x08, 0x08, 0x08, 0x06};
      memcpy(rows, data, kScrollFontHeight);
      return true;
    }
    case 'u': {
      const uint8_t data[kScrollFontHeight] = {0x00, 0x11, 0x11, 0x11, 0x13, 0x0D};
      memcpy(rows, data, kScrollFontHeight);
      return true;
    }
    case 'v': {
      const uint8_t data[kScrollFontHeight] = {0x00, 0x11, 0x11, 0x11, 0x0A, 0x04};
      memcpy(rows, data, kScrollFontHeight);
      return true;
    }
    case 'w': {
      const uint8_t data[kScrollFontHeight] = {0x00, 0x11, 0x11, 0x15, 0x15, 0x0A};
      memcpy(rows, data, kScrollFontHeight);
      return true;
    }
    case 'x': {
      const uint8_t data[kScrollFontHeight] = {0x00, 0x11, 0x0A, 0x04, 0x0A, 0x11};
      memcpy(rows, data, kScrollFontHeight);
      return true;
    }
    case 'y': {
      const uint8_t data[kScrollFontHeight] = {0x00, 0x11, 0x11, 0x0F, 0x01, 0x0E};
      memcpy(rows, data, kScrollFontHeight);
      return true;
    }
    case 'z': {
      const uint8_t data[kScrollFontHeight] = {0x00, 0x1F, 0x02, 0x04, 0x08, 0x1F};
      memcpy(rows, data, kScrollFontHeight);
      return true;
    }
    default:
      break;
  }

  const char up = static_cast<char>(toupper(static_cast<unsigned char>(c)));

  switch (up) {
    case 'A': {
      const uint8_t data[kScrollFontHeight] = {0x0E, 0x11, 0x1F, 0x11, 0x11, 0x11};
      memcpy(rows, data, kScrollFontHeight);
      return true;
    }
    case 'B': {
      const uint8_t data[kScrollFontHeight] = {0x1E, 0x11, 0x1E, 0x11, 0x11, 0x1E};
      memcpy(rows, data, kScrollFontHeight);
      return true;
    }
    case 'C': {
      const uint8_t data[kScrollFontHeight] = {0x0E, 0x11, 0x10, 0x10, 0x11, 0x0E};
      memcpy(rows, data, kScrollFontHeight);
      return true;
    }
    case 'D': {
      const uint8_t data[kScrollFontHeight] = {0x1E, 0x11, 0x11, 0x11, 0x11, 0x1E};
      memcpy(rows, data, kScrollFontHeight);
      return true;
    }
    case 'E': {
      const uint8_t data[kScrollFontHeight] = {0x1F, 0x10, 0x1E, 0x10, 0x10, 0x1F};
      memcpy(rows, data, kScrollFontHeight);
      return true;
    }
    case 'F': {
      const uint8_t data[kScrollFontHeight] = {0x1F, 0x10, 0x1E, 0x10, 0x10, 0x10};
      memcpy(rows, data, kScrollFontHeight);
      return true;
    }
    case 'G': {
      const uint8_t data[kScrollFontHeight] = {0x0E, 0x11, 0x10, 0x13, 0x11, 0x0F};
      memcpy(rows, data, kScrollFontHeight);
      return true;
    }
    case 'H': {
      const uint8_t data[kScrollFontHeight] = {0x11, 0x11, 0x1F, 0x11, 0x11, 0x11};
      memcpy(rows, data, kScrollFontHeight);
      return true;
    }
    case 'I': {
      const uint8_t data[kScrollFontHeight] = {0x1F, 0x04, 0x04, 0x04, 0x04, 0x1F};
      memcpy(rows, data, kScrollFontHeight);
      return true;
    }
    case 'J': {
      const uint8_t data[kScrollFontHeight] = {0x01, 0x01, 0x01, 0x11, 0x11, 0x0E};
      memcpy(rows, data, kScrollFontHeight);
      return true;
    }
    case 'K': {
      const uint8_t data[kScrollFontHeight] = {0x11, 0x12, 0x1C, 0x12, 0x11, 0x11};
      memcpy(rows, data, kScrollFontHeight);
      return true;
    }
    case 'L': {
      const uint8_t data[kScrollFontHeight] = {0x10, 0x10, 0x10, 0x10, 0x10, 0x1F};
      memcpy(rows, data, kScrollFontHeight);
      return true;
    }
    case 'M': {
      const uint8_t data[kScrollFontHeight] = {0x11, 0x1B, 0x15, 0x11, 0x11, 0x11};
      memcpy(rows, data, kScrollFontHeight);
      return true;
    }
    case 'N': {
      const uint8_t data[kScrollFontHeight] = {0x11, 0x19, 0x15, 0x13, 0x11, 0x11};
      memcpy(rows, data, kScrollFontHeight);
      return true;
    }
    case 'O': {
      const uint8_t data[kScrollFontHeight] = {0x0E, 0x11, 0x11, 0x11, 0x11, 0x0E};
      memcpy(rows, data, kScrollFontHeight);
      return true;
    }
    case 'P': {
      const uint8_t data[kScrollFontHeight] = {0x1E, 0x11, 0x1E, 0x10, 0x10, 0x10};
      memcpy(rows, data, kScrollFontHeight);
      return true;
    }
    case 'Q': {
      const uint8_t data[kScrollFontHeight] = {0x0E, 0x11, 0x11, 0x15, 0x12, 0x0D};
      memcpy(rows, data, kScrollFontHeight);
      return true;
    }
    case 'R': {
      const uint8_t data[kScrollFontHeight] = {0x1E, 0x11, 0x1E, 0x12, 0x11, 0x11};
      memcpy(rows, data, kScrollFontHeight);
      return true;
    }
    case 'S': {
      const uint8_t data[kScrollFontHeight] = {0x0F, 0x10, 0x0E, 0x01, 0x11, 0x0E};
      memcpy(rows, data, kScrollFontHeight);
      return true;
    }
    case 'T': {
      const uint8_t data[kScrollFontHeight] = {0x1F, 0x04, 0x04, 0x04, 0x04, 0x04};
      memcpy(rows, data, kScrollFontHeight);
      return true;
    }
    case 'U': {
      const uint8_t data[kScrollFontHeight] = {0x11, 0x11, 0x11, 0x11, 0x11, 0x0E};
      memcpy(rows, data, kScrollFontHeight);
      return true;
    }
    case 'V': {
      const uint8_t data[kScrollFontHeight] = {0x11, 0x11, 0x11, 0x11, 0x0A, 0x04};
      memcpy(rows, data, kScrollFontHeight);
      return true;
    }
    case 'W': {
      const uint8_t data[kScrollFontHeight] = {0x11, 0x11, 0x11, 0x15, 0x1B, 0x11};
      memcpy(rows, data, kScrollFontHeight);
      return true;
    }
    case 'X': {
      const uint8_t data[kScrollFontHeight] = {0x11, 0x0A, 0x04, 0x04, 0x0A, 0x11};
      memcpy(rows, data, kScrollFontHeight);
      return true;
    }
    case 'Y': {
      const uint8_t data[kScrollFontHeight] = {0x11, 0x0A, 0x04, 0x04, 0x04, 0x04};
      memcpy(rows, data, kScrollFontHeight);
      return true;
    }
    case 'Z': {
      const uint8_t data[kScrollFontHeight] = {0x1F, 0x02, 0x04, 0x08, 0x10, 0x1F};
      memcpy(rows, data, kScrollFontHeight);
      return true;
    }
    case '0': {
      const uint8_t data[kScrollFontHeight] = {0x0E, 0x11, 0x13, 0x15, 0x19, 0x0E};
      memcpy(rows, data, kScrollFontHeight);
      return true;
    }
    case '1': {
      const uint8_t data[kScrollFontHeight] = {0x04, 0x0C, 0x04, 0x04, 0x04, 0x0E};
      memcpy(rows, data, kScrollFontHeight);
      return true;
    }
    case '2': {
      const uint8_t data[kScrollFontHeight] = {0x0E, 0x11, 0x01, 0x06, 0x08, 0x1F};
      memcpy(rows, data, kScrollFontHeight);
      return true;
    }
    case '3': {
      const uint8_t data[kScrollFontHeight] = {0x1E, 0x01, 0x06, 0x01, 0x11, 0x0E};
      memcpy(rows, data, kScrollFontHeight);
      return true;
    }
    case '4': {
      const uint8_t data[kScrollFontHeight] = {0x02, 0x06, 0x0A, 0x12, 0x1F, 0x02};
      memcpy(rows, data, kScrollFontHeight);
      return true;
    }
    case '5': {
      const uint8_t data[kScrollFontHeight] = {0x1F, 0x10, 0x1E, 0x01, 0x11, 0x0E};
      memcpy(rows, data, kScrollFontHeight);
      return true;
    }
    case '6': {
      const uint8_t data[kScrollFontHeight] = {0x07, 0x08, 0x1E, 0x11, 0x11, 0x0E};
      memcpy(rows, data, kScrollFontHeight);
      return true;
    }
    case '7': {
      const uint8_t data[kScrollFontHeight] = {0x1F, 0x01, 0x02, 0x04, 0x08, 0x08};
      memcpy(rows, data, kScrollFontHeight);
      return true;
    }
    case '8': {
      const uint8_t data[kScrollFontHeight] = {0x0E, 0x11, 0x0E, 0x11, 0x11, 0x0E};
      memcpy(rows, data, kScrollFontHeight);
      return true;
    }
    case '9': {
      const uint8_t data[kScrollFontHeight] = {0x0E, 0x11, 0x11, 0x0F, 0x01, 0x0E};
      memcpy(rows, data, kScrollFontHeight);
      return true;
    }
    case '!': {
      const uint8_t data[kScrollFontHeight] = {0x04, 0x04, 0x04, 0x04, 0x00, 0x04};
      memcpy(rows, data, kScrollFontHeight);
      return true;
    }
    case '?': {
      const uint8_t data[kScrollFontHeight] = {0x0E, 0x11, 0x02, 0x04, 0x00, 0x04};
      memcpy(rows, data, kScrollFontHeight);
      return true;
    }
    case '.': {
      const uint8_t data[kScrollFontHeight] = {0x00, 0x00, 0x00, 0x00, 0x00, 0x04};
      memcpy(rows, data, kScrollFontHeight);
      return true;
    }
    case ':': {
      const uint8_t data[kScrollFontHeight] = {0x00, 0x04, 0x00, 0x00, 0x04, 0x00};
      memcpy(rows, data, kScrollFontHeight);
      return true;
    }
    case '-': {
      const uint8_t data[kScrollFontHeight] = {0x00, 0x00, 0x1F, 0x00, 0x00, 0x00};
      memcpy(rows, data, kScrollFontHeight);
      return true;
    }
    case '_': {
      const uint8_t data[kScrollFontHeight] = {0x00, 0x00, 0x00, 0x00, 0x00, 0x1F};
      memcpy(rows, data, kScrollFontHeight);
      return true;
    }
    case '/': {
      const uint8_t data[kScrollFontHeight] = {0x01, 0x02, 0x04, 0x08, 0x10, 0x00};
      memcpy(rows, data, kScrollFontHeight);
      return true;
    }
    case '\\': {
      const uint8_t data[kScrollFontHeight] = {0x10, 0x08, 0x04, 0x02, 0x01, 0x00};
      memcpy(rows, data, kScrollFontHeight);
      return true;
    }
    case '<': {
      const uint8_t data[kScrollFontHeight] = {0x02, 0x04, 0x08, 0x04, 0x02, 0x00};
      memcpy(rows, data, kScrollFontHeight);
      return true;
    }
    case '>': {
      const uint8_t data[kScrollFontHeight] = {0x08, 0x04, 0x02, 0x04, 0x08, 0x00};
      memcpy(rows, data, kScrollFontHeight);
      return true;
    }
    case '*': {
      const uint8_t data[kScrollFontHeight] = {0x04, 0x15, 0x0E, 0x15, 0x04, 0x00};
      memcpy(rows, data, kScrollFontHeight);
      return true;
    }
    case '"': {
      const uint8_t data[kScrollFontHeight] = {0x0A, 0x0A, 0x00, 0x00, 0x00, 0x00};
      memcpy(rows, data, kScrollFontHeight);
      return true;
    }
    case '\'': {
      const uint8_t data[kScrollFontHeight] = {0x04, 0x04, 0x00, 0x00, 0x00, 0x00};
      memcpy(rows, data, kScrollFontHeight);
      return true;
    }
    case '[': {
      const uint8_t data[kScrollFontHeight] = {0x0E, 0x08, 0x08, 0x08, 0x0E, 0x00};
      memcpy(rows, data, kScrollFontHeight);
      return true;
    }
    case ']': {
      const uint8_t data[kScrollFontHeight] = {0x0E, 0x02, 0x02, 0x02, 0x0E, 0x00};
      memcpy(rows, data, kScrollFontHeight);
      return true;
    }
    case '@': {
      const uint8_t data[kScrollFontHeight] = {0x0E, 0x11, 0x17, 0x15, 0x16, 0x0C};
      memcpy(rows, data, kScrollFontHeight);
      return true;
    }
    case '#': {
      const uint8_t data[kScrollFontHeight] = {0x0A, 0x1F, 0x0A, 0x1F, 0x0A, 0x00};
      memcpy(rows, data, kScrollFontHeight);
      return true;
    }
    case ' ': {
      return true;
    }
    default: {
      const uint8_t data[kScrollFontHeight] = {0x0E, 0x11, 0x02, 0x04, 0x00, 0x04};
      memcpy(rows, data, kScrollFontHeight);
      return false;
    }
  }
}

void drawGlyphAt(int16_t x, int16_t y, char c, uint32_t color) {
  uint8_t rows[kScrollFontHeight] = {0};
  loadGlyphRows(c, rows);

