igorhmc/yd-esp32-23/src/main.cpp
  for (uint8_t row = 0; row < kScrollFontHeight; row++) {
    const uint8_t rowBits = rows[row];
    for (uint8_t col = 0; col < kScrollGlyphWidth; col++) {
      if ((rowBits & (1 << (kScrollGlyphWidth - 1 - col))) == 0) {
        continue;
      }

      const int16_t px = x + col;
      const int16_t py = y + row;
      if (px < 0 || py < 0 || px >= matrixWidth() || py >= MATRIX_HEIGHT) {
        continue;
      }

      setMatrixPixel(static_cast<uint16_t>(px), static_cast<uint8_t>(py), color);
    }
  }
}

int16_t scrollTextPixelWidth(const String &text) {
  if (text.length() == 0) {
    return 0;
  }

  return static_cast<int16_t>(text.length() * (kScrollGlyphWidth + kScrollGlyphSpacing));
}

int16_t scrollLoopPeriodPx(const String &text) {
  const int16_t textWidth = scrollTextPixelWidth(text);
  if (textWidth <= 0) {
    return 1;
  }
  return textWidth;
}

int16_t scrollStartOffsetX(ScrollDirection direction, const String &text) {
  if (direction == ScrollDirection::Right) {
    return -scrollTextPixelWidth(text);
  }
  return matrixWidth();
}

bool buildMulticolorScrollText(const String &payload, String &outText) {
  outText = "";
  memset(gMatrixScrollCharColors, 0, sizeof(gMatrixScrollCharColors));

  bool hasAny = false;
  int start = 0;
  while (start <= static_cast<int>(payload.length())) {
    const int separator = payload.indexOf('|', start);
    String item = separator < 0 ? payload.substring(start) : payload.substring(start, separator);
    item.trim();

    if (item.length() > 0) {
      const int colon = item.indexOf(':');
      if (colon <= 0) {
        return false;
      }

      String colorText = item.substring(0, colon);
      colorText.trim();
      String segmentText = item.substring(colon + 1);

      if (segmentText.length() > 0) {
        RgbColor segmentColor = {0, 0, 0};
        if (!parseHexColor(colorText, segmentColor)) {
          return false;
        }

        const uint32_t packed = packColor(segmentColor.r, segmentColor.g, segmentColor.b);
        for (size_t i = 0; i < segmentText.length(); i++) {
          if (outText.length() >= kScrollTextMaxLength) {
            break;
          }
          gMatrixScrollCharColors[outText.length()] = packed;
          outText += segmentText.charAt(i);
        }

        hasAny = outText.length() > 0;
      }
    }

    if (separator < 0) {
      break;
    }
    start = separator + 1;
  }

  return hasAny;
}

void renderMatrixScrollFrame() {
  if (!gMatrixReady || !gMatrixScrollRunning) {
    return;
  }

  clearMatrixBuffer();

  const int16_t yOffset = MATRIX_HEIGHT > kScrollFontHeight ? (MATRIX_HEIGHT - kScrollFontHeight) / 2 : 0;
  const uint32_t color = packColor(gLedColor.r, gLedColor.g, gLedColor.b);
  const int16_t textWidth = scrollTextPixelWidth(gMatrixScrollText);
  const int16_t period = scrollLoopPeriodPx(gMatrixScrollText);
  if (textWidth <= 0 || period <= 0) {
    showMatrix();
    return;
  }

  if (gMatrixScrollDirection == ScrollDirection::Right) {
    for (int16_t baseX = gMatrixScrollOffsetX; baseX + textWidth >= 0; baseX -= period) {
      for (size_t i = 0; i < gMatrixScrollText.length(); i++) {
        const int16_t x = baseX + static_cast<int16_t>(i * (kScrollGlyphWidth + kScrollGlyphSpacing));
        if (x > (matrixWidth() - 1) || (x + kScrollGlyphWidth) < 0) {
          continue;
        }
        const uint32_t glyphColor =
          (gMatrixScrollUseCharColors && i < kScrollTextMaxLength) ? gMatrixScrollCharColors[i] : color;
        drawGlyphAt(x, yOffset, gMatrixScrollText.charAt(i), glyphColor);
      }
    }
  } else {
    for (int16_t baseX = gMatrixScrollOffsetX; baseX < matrixWidth(); baseX += period) {
      for (size_t i = 0; i < gMatrixScrollText.length(); i++) {
        const int16_t x = baseX + static_cast<int16_t>(i * (kScrollGlyphWidth + kScrollGlyphSpacing));
        if (x > (matrixWidth() - 1) || (x + kScrollGlyphWidth) < 0) {
          continue;
        }
        const uint32_t glyphColor =
          (gMatrixScrollUseCharColors && i < kScrollTextMaxLength) ? gMatrixScrollCharColors[i] : color;
        drawGlyphAt(x, yOffset, gMatrixScrollText.charAt(i), glyphColor);
      }
    }
  }

  showMatrix();
}

bool startMatrixScrollCore(String text, uint16_t speedMs) {
  if (!gMatrixReady || gMatrixActiveLedCount == 0) {
    return false;
  }

  text.replace("\r", "");
  text.replace("\n", " ");
  if (text.length() == 0) {
    return false;
  }

  if (text.length() > kScrollTextMaxLength) {
    text.remove(kScrollTextMaxLength);
  }

  gMatrixScrollText = text;
  gMatrixScrollStepMs = static_cast<uint16_t>(constrain(static_cast<int>(speedMs), 40, 1000));
  gMatrixScrollOffsetX = scrollStartOffsetX(gMatrixScrollDirection, gMatrixScrollText);
  gMatrixScrollLastStepMs = millis();
  gMatrixScrollRunning = true;
  gMatrixTestRunning = false;
  renderMatrixScrollFrame();
  Serial.printf("[OK] Scroll text started: \"%s\" | speed=%u ms | dir=%s\n",
                gMatrixScrollText.c_str(),
                gMatrixScrollStepMs,
                scrollDirectionToString(gMatrixScrollDirection));
  return true;
}

bool startMatrixScroll(String text, uint16_t speedMs) {
  gMatrixScrollUseCharColors = false;
  return startMatrixScrollCore(text, speedMs);
}

bool startMatrixScrollSegments(String payload, uint16_t speedMs) {
  String multicolorText;
  if (!buildMulticolorScrollText(payload, multicolorText)) {
    return false;
  }
  gMatrixScrollUseCharColors = true;
  return startMatrixScrollCore(multicolorText, speedMs);
}

void stopMatrixScroll() {
  if (!gMatrixScrollRunning) {
    return;
  }
  gMatrixScrollRunning = false;
  applyMatrixSolidColor(gLedColor);
  Serial.println("[OK] Scroll text stopped.");
}

void tickMatrixScroll() {
  if (!gMatrixReady || !gMatrixScrollRunning) {
    return;
  }

  const unsigned long now = millis();
  if ((now - gMatrixScrollLastStepMs) < gMatrixScrollStepMs) {
    return;
  }
  gMatrixScrollLastStepMs = now;

  const int16_t period = scrollLoopPeriodPx(gMatrixScrollText);
  if (period <= 0) {
    return;
  }
  if (gMatrixScrollDirection == ScrollDirection::Right) {
    gMatrixScrollOffsetX++;
    if (gMatrixScrollOffsetX >= period) {
      gMatrixScrollOffsetX -= period;
    }
  } else {
    gMatrixScrollOffsetX--;
    if (gMatrixScrollOffsetX <= -period) {
      gMatrixScrollOffsetX += period;
    }
  }

  renderMatrixScrollFrame();
}

void startMatrixTest() {
  if (!gMatrixReady || gMatrixActiveLedCount == 0) {
    return;
  }
  gMatrixScrollRunning = false;
  gMatrixTestRunning = true;
  gMatrixTestIndex = 0;
  gMatrixLastStepMs = 0;
  Serial.println("[OK] Matrix test started.");
}

void tickMatrixTest() {
  if (!gMatrixReady || !gMatrixTestRunning) {
    return;
  }

  const unsigned long now = millis();
  if (now - gMatrixLastStepMs < 55) {
    return;
  }
  gMatrixLastStepMs = now;

  clearMatrixBuffer();
  uint8_t wheel = 0;
  if (gMatrixActiveLedCount > 1) {
    wheel = static_cast<uint8_t>((gMatrixTestIndex * 255) / (gMatrixActiveLedCount - 1));
  }
  const uint16_t x = static_cast<uint16_t>(gMatrixTestIndex % matrixWidth());
  const uint8_t y = static_cast<uint8_t>(gMatrixTestIndex / matrixWidth());
  setMatrixPixel(x, y, colorWheel(wheel));
  showMatrix();

  gMatrixTestIndex++;
  if (gMatrixTestIndex >= gMatrixActiveLedCount) {
    gMatrixTestRunning = false;
    applyMatrixSolidColor(gLedColor);
    Serial.println("[OK] Matrix test completed.");
  }
}

void releaseMatrixControllers(Adafruit_NeoPixel *controllers[MATRIX_OUTPUT_COUNT]) {
  for (uint8_t output = 0; output < MATRIX_OUTPUT_COUNT; output++) {
    if (controllers[output] != nullptr) {
      controllers[output]->clear();
      controllers[output]->show();
      delete controllers[output];
      controllers[output] = nullptr;
    }
  }
}

void releaseMatrixBuffers(uint32_t *buffers[MATRIX_OUTPUT_COUNT]) {
  for (uint8_t output = 0; output < MATRIX_OUTPUT_COUNT; output++) {
    if (buffers[output] != nullptr) {
      delete[] buffers[output];
      buffers[output] = nullptr;
    }
  }
}

