igorhmc/yd-esp32-23/src/main.cpp
bool createMatrixResources(const uint8_t pins[MATRIX_OUTPUT_COUNT],
                           uint8_t activeOutputs,
                           const uint16_t counts[MATRIX_OUTPUT_COUNT],
                           Adafruit_NeoPixel *controllers[MATRIX_OUTPUT_COUNT],
                           uint32_t *buffers[MATRIX_OUTPUT_COUNT]) {
  for (uint8_t output = 0; output < MATRIX_OUTPUT_COUNT; output++) {
    controllers[output] = nullptr;
    buffers[output] = nullptr;
  }

  for (uint8_t output = 0; output < activeOutputs; output++) {
    const uint8_t pin = pins[output];
    const uint16_t ledCount = counts[output];
    if (!isValidMatrixPin(pin)) {
      Serial.printf("[FAIL] Invalid matrix pin on output %u: %u\n",
                    static_cast<unsigned>(output),
                    static_cast<unsigned>(pin));
      releaseMatrixControllers(controllers);
      releaseMatrixBuffers(buffers);
      return false;
    }

    if (ledCount == 0) {
      Serial.printf("[FAIL] Invalid LED count on output %u\n",
                    static_cast<unsigned>(output));
      releaseMatrixControllers(controllers);
      releaseMatrixBuffers(buffers);
      return false;
    }

    buffers[output] = new (std::nothrow) uint32_t[ledCount];
    if (buffers[output] == nullptr) {
      Serial.printf("[FAIL] Matrix buffer allocation failed on output %u (count=%u)\n",
                    static_cast<unsigned>(output),
                    static_cast<unsigned>(ledCount));
      releaseMatrixControllers(controllers);
      releaseMatrixBuffers(buffers);
      return false;
    }
    for (uint16_t i = 0; i < ledCount; i++) {
      buffers[output][i] = 0;
    }

    controllers[output] = new (std::nothrow) Adafruit_NeoPixel(
      ledCount, pin, NEO_GRB + NEO_KHZ800);
    if (controllers[output] == nullptr) {
      Serial.printf("[FAIL] Matrix strip allocation failed on output %u (pin=%u)\n",
                    static_cast<unsigned>(output),
                    static_cast<unsigned>(pin));
      releaseMatrixControllers(controllers);
      releaseMatrixBuffers(buffers);
      return false;
    }

    controllers[output]->begin();
    controllers[output]->clear();
    controllers[output]->show();
  }

  return true;
}

bool initMatrix() {
  if (!matrixPinsAreUnique(gMatrixPins, gMatrixActiveOutputs)) {
    Serial.println("[FAIL] Matrix outputs must use unique GPIO pins.");
    gMatrixReady = false;
    return false;
  }

  String geometryError;
  if (!rebuildMatrixGeometry(gMatrixLedsPerOutput, gMatrixActiveOutputs, geometryError)) {
    Serial.printf("[FAIL] Matrix geometry invalid: %s\n", geometryError.c_str());
    gMatrixReady = false;
    return false;
  }

  Adafruit_NeoPixel *newControllers[MATRIX_OUTPUT_COUNT] = {nullptr};
  uint32_t *newBuffers[MATRIX_OUTPUT_COUNT] = {nullptr};
  if (!createMatrixResources(gMatrixPins, gMatrixActiveOutputs, gMatrixLedsPerOutput, newControllers, newBuffers)) {
    gMatrixReady = false;
    return false;
  }

  releaseMatrixControllers(gMatrixStrips);
  releaseMatrixBuffers(gMatrixBuffer);
  for (uint8_t output = 0; output < MATRIX_OUTPUT_COUNT; output++) {
    gMatrixStrips[output] = newControllers[output];
    gMatrixBuffer[output] = newBuffers[output];
    newControllers[output] = nullptr;
    newBuffers[output] = nullptr;
  }

  gMatrixDataPin = gMatrixPins[0];
  gMatrixReady = true;
  clearMatrixBuffer();
  showMatrix();
  Serial.printf("[OK] Parallel WS2812 matrix ready | outputs=%u/%u | pins=[%s] | counts=[%s] | width=%u | leds=%u | brightness=%u\n",
                static_cast<unsigned>(gMatrixActiveOutputs),
                static_cast<unsigned>(MATRIX_OUTPUT_COUNT),
                matrixPinsCsv().c_str(),
                matrixCountsCsv().c_str(),
                static_cast<unsigned>(matrixWidth()),
                static_cast<unsigned>(gMatrixActiveLedCount),
                gMatrixBrightness);
  return true;
}

bool applyMatrixPins(const uint8_t newPins[MATRIX_OUTPUT_COUNT]) {
  if (!matrixPinsAreUnique(newPins, gMatrixActiveOutputs)) {
    return false;
  }

  bool changed = false;
  for (uint8_t i = 0; i < gMatrixActiveOutputs; i++) {
    if (gMatrixPins[i] != newPins[i]) {
      changed = true;
      break;
    }
  }
  if (!changed) {
    return true;
  }

  uint8_t previousPins[MATRIX_OUTPUT_COUNT] = {0};
  for (uint8_t i = 0; i < gMatrixActiveOutputs; i++) {
    previousPins[i] = gMatrixPins[i];
    gMatrixPins[i] = newPins[i];
  }
  gMatrixDataPin = gMatrixPins[0];

  const bool wasScrollRunning = gMatrixScrollRunning;
  gMatrixTestRunning = false;
  gMatrixScrollRunning = false;

  if (!initMatrix()) {
    for (uint8_t i = 0; i < gMatrixActiveOutputs; i++) {
      gMatrixPins[i] = previousPins[i];
    }
    gMatrixDataPin = gMatrixPins[0];
    if (!initMatrix()) {
      gMatrixReady = false;
    }
    return false;
  }

  if (wasScrollRunning) {
    gMatrixScrollRunning = true;
    gMatrixScrollOffsetX = scrollStartOffsetX(gMatrixScrollDirection, gMatrixScrollText);
    gMatrixScrollLastStepMs = millis();
    renderMatrixScrollFrame();
  } else {
    applyMatrixSolidColor(gLedColor);
  }
  Serial.printf("[OK] Matrix pins updated to [%s]\n", matrixPinsCsv().c_str());
  return true;
}

bool applyMatrixCounts(const uint16_t newCounts[MATRIX_OUTPUT_COUNT]) {
  String errorCode;
  if (!matrixCountsAreValid(newCounts, gMatrixActiveOutputs, errorCode)) {
    return false;
  }

  bool changed = false;
  for (uint8_t i = 0; i < gMatrixActiveOutputs; i++) {
    if (gMatrixLedsPerOutput[i] != newCounts[i]) {
      changed = true;
      break;
    }
  }
  if (!changed) {
    return true;
  }

  uint16_t previousCounts[MATRIX_OUTPUT_COUNT] = {0};
  for (uint8_t i = 0; i < gMatrixActiveOutputs; i++) {
    previousCounts[i] = gMatrixLedsPerOutput[i];
    gMatrixLedsPerOutput[i] = newCounts[i];
  }

  const bool wasScrollRunning = gMatrixScrollRunning;
  gMatrixTestRunning = false;
  gMatrixScrollRunning = false;

  if (!initMatrix()) {
    for (uint8_t i = 0; i < gMatrixActiveOutputs; i++) {
      gMatrixLedsPerOutput[i] = previousCounts[i];
    }
    if (!initMatrix()) {
      gMatrixReady = false;
    }
    return false;
  }

  if (wasScrollRunning) {
    gMatrixScrollRunning = true;
    gMatrixScrollOffsetX = scrollStartOffsetX(gMatrixScrollDirection, gMatrixScrollText);
    gMatrixScrollLastStepMs = millis();
    renderMatrixScrollFrame();
  } else {
    applyMatrixSolidColor(gLedColor);
  }
  Serial.printf("[OK] Matrix LED counts updated to [%s]\n", matrixCountsCsv().c_str());
  return true;
}

