igorhmc/yd-esp32-23/src/main.cpp
bool applyMatrixActiveOutputs(uint8_t newActiveOutputs, String &errorCode) {
  newActiveOutputs = clampActiveOutputs(static_cast<int>(newActiveOutputs));
  if (newActiveOutputs == gMatrixActiveOutputs) {
    return true;
  }

  if (!matrixPinsAreUnique(gMatrixPins, newActiveOutputs)) {
    errorCode = "duplicate_pins_for_active_outputs";
    return false;
  }
  if (!matrixCountsAreValid(gMatrixLedsPerOutput, newActiveOutputs, errorCode)) {
    return false;
  }

  const uint8_t previousActiveOutputs = gMatrixActiveOutputs;
  gMatrixActiveOutputs = newActiveOutputs;
  gMatrixRuntimeMaxLedCount = detectRuntimeMaxLedCount();

  const bool wasScrollRunning = gMatrixScrollRunning;
  gMatrixTestRunning = false;
  gMatrixScrollRunning = false;

  if (!initMatrix()) {
    gMatrixActiveOutputs = previousActiveOutputs;
    gMatrixRuntimeMaxLedCount = detectRuntimeMaxLedCount();
    if (!initMatrix()) {
      gMatrixReady = false;
    }
    errorCode = "matrix_active_outputs_apply_failed";
    return false;
  }

  if (wasScrollRunning) {
    gMatrixScrollRunning = true;
    gMatrixScrollOffsetX = scrollStartOffsetX(gMatrixScrollDirection, gMatrixScrollText);
    gMatrixScrollLastStepMs = millis();
    renderMatrixScrollFrame();
  } else {
    applyMatrixSolidColor(gLedColor);
  }

  Serial.printf("[OK] Active outputs updated to %u/%u\n",
                static_cast<unsigned>(gMatrixActiveOutputs),
                static_cast<unsigned>(MATRIX_OUTPUT_COUNT));
  return true;
}

void rgbTest() {
  const RgbPinList rgbPins = buildRgbPinList();
  if (rgbPins.count == 0) {
    Serial.println("[INFO] Onboard RGB not detected in this variant.");
    return;
  }

  struct ColorStep {
    const char *name;
    uint8_t r;
    uint8_t g;
    uint8_t b;
  };

  const ColorStep steps[] = {
    {"RED", 24, 0, 0},
    {"GREEN", 0, 24, 0},
    {"BLUE", 0, 0, 24},
    {"WHITE", 18, 18, 18},
    {"OFF", 0, 0, 0},
  };

  Serial.print("Onboard RGB test on GPIOs:");
  for (size_t i = 0; i < rgbPins.count; i++) {
    Serial.printf(" %d", rgbPins.pins[i]);
  }
  Serial.println();
  Serial.println("If it does not light up, check the WS2812 solder jumper on IO48.");

  for (const auto &step : steps) {
    Serial.printf("  -> %s\n", step.name);
    writeRgbAllPins(rgbPins, step.r, step.g, step.b);
    delay(350);
  }
}

void printSystemInfo() {
  Serial.println("=== ESP32-S3 DIAGNOSTICS ===");
  Serial.printf("Chip Model: %s\n", ESP.getChipModel());
  Serial.printf("Chip Cores: %u\n", ESP.getChipCores());
  Serial.printf("Chip Revision: %u\n", ESP.getChipRevision());
  Serial.printf("CPU Freq: %lu MHz\n", ESP.getCpuFreqMHz());
  Serial.printf("Flash Size: %u MB\n", ESP.getFlashChipSize() / (1024 * 1024));
  Serial.printf("Free Heap: %u bytes\n", ESP.getFreeHeap());
  Serial.printf("PSRAM Size: %u bytes\n", ESP.getPsramSize());
  Serial.printf("Free PSRAM: %u bytes\n", ESP.getFreePsram());
}

bool psramPatternTest() {
  const size_t psramSize = ESP.getPsramSize();
  if (psramSize == 0) {
    Serial.println("[FAIL] PSRAM not detected.");
    return false;
  }

  const size_t testSize = 256 * 1024;
  uint8_t *buffer = static_cast<uint8_t *>(ps_malloc(testSize));
  if (buffer == nullptr) {
    Serial.println("[FAIL] Could not allocate PSRAM buffer.");
    return false;
  }

  for (size_t i = 0; i < testSize; i++) {
    buffer[i] = static_cast<uint8_t>((i ^ 0xA5) & 0xFF);
  }
  for (size_t i = 0; i < testSize; i++) {
    const uint8_t expected = static_cast<uint8_t>((i ^ 0xA5) & 0xFF);
    if (buffer[i] != expected) {
      Serial.printf("[FAIL] PSRAM mismatch at %u\n", static_cast<unsigned>(i));
      free(buffer);
      return false;
    }
  }

  free(buffer);
  Serial.printf("[OK] PSRAM tested %u bytes.\n", static_cast<unsigned>(testSize));
  return true;
}

bool nvsCounterTest() {
  Preferences pref;
  if (!pref.begin("diag", false)) {
    Serial.println("[FAIL] NVS did not open.");
    return false;
  }
  const uint32_t boots = pref.getUInt("boots", 0) + 1;
  const bool saved = pref.putUInt("boots", boots) > 0;
  pref.end();
  if (!saved) {
    Serial.println("[FAIL] NVS did not save counter.");
    return false;
  }
  Serial.printf("[OK] NVS boot counter: %u\n", boots);
  return true;
}

bool startMdns() {
  if (!WiFi.isConnected()) {
    return false;
  }
  if (!MDNS.begin(DEVICE_HOSTNAME)) {
    Serial.println("[FAIL] mDNS did not start.");
    return false;
  }
  MDNS.addService("http", "tcp", 80);
  Serial.printf("[OK] mDNS active at http://%s.local\n", DEVICE_HOSTNAME);
  return true;
}

String buildStateJson() {
  String json = "{";
  json += "\"r\":" + String(gLedColor.r) + ",";
  json += "\"g\":" + String(gLedColor.g) + ",";
  json += "\"b\":" + String(gLedColor.b) + ",";
  json += "\"hex\":\"" + ledHexColor() + "\",";
  json += "\"wifi\":" + String(static_cast<int>(WiFi.status())) + ",";
  json += "\"ip\":\"" + WiFi.localIP().toString() + "\",";
  json += "\"sta_connected\":" + String(WiFi.isConnected() ? 1 : 0) + ",";
  json += "\"wifi_ssid\":\"" + jsonEscape(WiFi.SSID()) + "\",";
  json += "\"hostname\":\"" + String(DEVICE_HOSTNAME) + "\",";
  json += "\"safe_mode\":" + String(gSafeMode ? 1 : 0) + ",";
  json += "\"safe_reason\":\"" + jsonEscape(gSafeModeReason) + "\",";
  json += "\"boot_attempts\":" + String(gBootGuardAttempts) + ",";
  json += "\"ap_mode\":" + String(gApMode ? 1 : 0) + ",";
  json += "\"ap_ssid\":\"" + jsonEscape(gApSsid) + "\",";
  json += "\"ap_ip\":\"" + WiFi.softAPIP().toString() + "\",";
  json += "\"matrix_pin\":" + String(gMatrixDataPin) + ",";
  json += "\"matrix_outputs\":" + String(static_cast<unsigned>(MATRIX_OUTPUT_COUNT)) + ",";
  json += "\"matrix_active_outputs\":" + String(static_cast<unsigned>(gMatrixActiveOutputs)) + ",";
  json += "\"matrix_pins\":\"" + matrixPinsCsv() + "\",";
  json += "\"matrix_counts\":\"" + matrixCountsCsv() + "\",";
  json += "\"matrix_scan\":\"" + String(matrixScanOrderToString(gMatrixScanOrder)) + "\",";
  json += "\"matrix_x_flip\":" + String(gMatrixXFlip ? 1 : 0) + ",";
  json += "\"matrix_y_flip\":" + String(gMatrixYFlip ? 1 : 0) + ",";
  json += "\"matrix_width\":" + String(matrixWidth()) + ",";
  json += "\"matrix_count\":" + String(gMatrixActiveLedCount) + ",";
  json += "\"matrix_max_count\":" + String(gMatrixRuntimeMaxLedCount) + ",";
  json += "\"matrix_brightness\":" + String(gMatrixBrightness) + ",";
  json += "\"matrix_test\":" + String(gMatrixTestRunning ? 1 : 0) + ",";
  json += "\"matrix_scroll\":" + String(gMatrixScrollRunning ? 1 : 0) + ",";
  json += "\"matrix_scroll_speed\":" + String(gMatrixScrollStepMs) + ",";
  json += "\"matrix_scroll_multicolor\":" + String(gMatrixScrollUseCharColors ? 1 : 0) + ",";
  json += "\"matrix_scroll_direction\":\"" + String(scrollDirectionToString(gMatrixScrollDirection)) + "\",";
  json += "\"matrix_scroll_text\":\"" + jsonEscape(gMatrixScrollText) + "\"";
  json += "}";
  return json;
}

void handleRoot() {
  static const char kHtml[] PROGMEM = R"HTML(
<!doctype html>
<html lang="en">
<head>
  <meta charset="utf-8">
  <meta name="viewport" content="width=device-width,initial-scale=1">
  <title>ESP32 RGB + Matrix</title>
  <style>
    :root { --bg:#0b1220; --card:#101827; --text:#e6edf7; --muted:#96a3b8; --line:#223047; }
    * { box-sizing:border-box; }
    body {
      margin:0;
      min-height:100vh;
      font-family:Segoe UI,Arial,sans-serif;
      color:var(--text);
      background:radial-gradient(circle at top left,#16213b,#0a0f1a 70%);
      display:flex;
      align-items:center;
      justify-content:center;
      padding:20px;
    }
    .card {
      width:min(680px,100%);
      background:var(--card);
      border:1px solid var(--line);
      border-radius:16px;
      box-shadow:0 24px 40px rgba(0,0,0,.35);
      padding:20px;
    }
    h1 { margin:0 0 6px; font-size:24px; }
    p { margin:0 0 14px; color:var(--muted); }
    .row { display:flex; flex-wrap:wrap; gap:10px; align-items:center; margin:12px 0; }
    input[type=color] { width:120px; height:50px; border:0; background:none; padding:0; cursor:pointer; }
    button {
      border:1px solid #2b3a55;
      border-radius:10px;
      padding:9px 12px;
      cursor:pointer;
      color:var(--text);
      background:#152238;
    }
    button:hover { background:#1b2d48; }
    .status { margin-top:12px; color:var(--muted); font-size:14px; line-height:1.4; }
    .dot { width:16px; height:16px; border-radius:50%; border:1px solid #30415f; }
    .label { font-size:14px; color:var(--muted); min-width:130px; }
    input[type=range] { width:min(320px,100%); }
  </style>
</head>
<body>
  <main class="card">
    <h1>ESP32 RGB + WS2812 Matrix</h1>
    <p>Color controls both the onboard LED and the WS2812 matrix.</p>

