igorhmc/yd-esp32-23/src/main.cpp
    <div class="row">
      <input id="picker" type="color" value="#000000">
      <button data-color="#FF0000">Red</button>
      <button data-color="#00FF00">Green</button>
      <button data-color="#0000FF">Blue</button>
      <button id="off">Off</button>
    </div>

    <div class="row">
      <span class="label">Matrix brightness</span>
      <input id="brightness" type="range" min="0" max="255" value="32">
      <span id="brightnessVal">32</span>
    </div>

    <div class="row">
      <span class="label">Matrix pins (CSV)</span>
      <input id="matrixPins" type="text" value="14,17" placeholder="14,13" style="flex:1;min-width:220px;padding:8px;border-radius:8px;border:1px solid #2b3a55;background:#0f1729;color:#e6edf7;">
      <button id="matrixPinsApply">Apply pins</button>
    </div>

    <div class="row">
      <span class="label">Active outputs</span>
      <input id="matrixActiveOutputs" type="number" min="1" max="8" value="2" style="width:110px;padding:8px;border-radius:8px;border:1px solid #2b3a55;background:#0f1729;color:#e6edf7;">
      <button id="matrixActiveOutputsApply">Apply outputs</button>
    </div>

    <div class="row">
      <span class="label">Matrix wiring map</span>
      <select id="matrixScan" style="padding:8px;border-radius:8px;border:1px solid #2b3a55;background:#0f1729;color:#e6edf7;">
        <option value="column">Column serpentine</option>
        <option value="row">Row serpentine</option>
      </select>
    </div>

    <div class="row">
      <span class="label">Mirror</span>
      <label style="display:flex;align-items:center;gap:6px;"><input id="matrixFlipX" type="checkbox"> X</label>
      <label style="display:flex;align-items:center;gap:6px;"><input id="matrixFlipY" type="checkbox"> Y</label>
    </div>

    <div class="row">
      <span class="label">LEDs/modules per output</span>
      <input id="matrixCounts" type="text" value="64,64" placeholder="64,1x64+1x256" style="flex:1;min-width:220px;padding:8px;border-radius:8px;border:1px solid #2b3a55;background:#0f1729;color:#e6edf7;">
      <button id="matrixCountsApply">Apply LED counts</button>
    </div>

    <div class="row">
      <button id="matrixTest">Run matrix test</button>
      <div class="dot" id="dot"></div>
    </div>

    <h3>8x8 Text Scroll</h3>
    <div class="row">
      <span class="label">Message</span>
      <input id="matrixText" type="text" maxlength="64" placeholder="Type your message" style="flex:1;min-width:220px;padding:8px;border-radius:8px;border:1px solid #2b3a55;background:#0f1729;color:#e6edf7;">
    </div>
    <div class="row">
      <span class="label">Color mode</span>
      <select id="matrixScrollMode" style="padding:8px;border-radius:8px;border:1px solid #2b3a55;background:#0f1729;color:#e6edf7;">
        <option value="single">Single color</option>
        <option value="multi">Color per word/phrase</option>
      </select>
    </div>
    <div id="segmentsPanel" style="display:none;border:1px solid #2b3a55;border-radius:10px;padding:10px;margin:10px 0;">
      <div id="segmentsList"></div>
      <div class="row" style="margin-top:8px;">
        <button id="addSegment" type="button">Add word/phrase color</button>
      </div>
    </div>
    <div class="row">
      <span class="label">Speed (ms)</span>
      <input id="matrixScrollSpeed" type="range" min="40" max="1000" value="120">
      <span id="matrixScrollSpeedVal">120</span>
    </div>
    <div class="row">
      <span class="label">Direction</span>
      <select id="matrixScrollDirection" style="padding:8px;border-radius:8px;border:1px solid #2b3a55;background:#0f1729;color:#e6edf7;">
        <option value="left">Right to left</option>
        <option value="right">Left to right</option>
      </select>
    </div>
    <div class="row">
      <button id="matrixTextStart">Start scroll</button>
      <button id="matrixTextStop">Stop scroll</button>
    </div>

    <h3>Wi-Fi</h3>
    <div class="row">
      <span class="label">SSID</span>
      <input id="wifiSsid" type="text" placeholder="Network name" style="flex:1;min-width:220px;padding:8px;border-radius:8px;border:1px solid #2b3a55;background:#0f1729;color:#e6edf7;">
    </div>
    <div class="row">
      <span class="label">Password</span>
      <input id="wifiPass" type="password" placeholder="Network password" style="flex:1;min-width:220px;padding:8px;border-radius:8px;border:1px solid #2b3a55;background:#0f1729;color:#e6edf7;">
    </div>
    <div class="row">
      <button id="wifiSave">Save + Connect</button>
      <button id="wifiForget">Forget Wi-Fi</button>
    </div>

    <h3>OTA (firmware update)</h3>
    <div class="row">
      <input id="otaFile" type="file" accept=".bin,application/octet-stream" style="flex:1;min-width:220px;">
      <button id="otaUpload">Upload firmware</button>
    </div>
    <div class="row" id="recoverRow" style="display:none;">
      <button id="recoverBtn">Exit safe mode + reboot</button>
    </div>

    <div class="status" id="status">Loading...</div>
  </main>

  <script>
    const picker = document.getElementById('picker');
    const statusEl = document.getElementById('status');
    const dot = document.getElementById('dot');
    const brightness = document.getElementById('brightness');
    const brightnessVal = document.getElementById('brightnessVal');
    const matrixPins = document.getElementById('matrixPins');
    const matrixPinsApply = document.getElementById('matrixPinsApply');
    const matrixActiveOutputs = document.getElementById('matrixActiveOutputs');
    const matrixActiveOutputsApply = document.getElementById('matrixActiveOutputsApply');
    const matrixScan = document.getElementById('matrixScan');
    const matrixFlipX = document.getElementById('matrixFlipX');
    const matrixFlipY = document.getElementById('matrixFlipY');
    const matrixCounts = document.getElementById('matrixCounts');
    const matrixCountsApply = document.getElementById('matrixCountsApply');
    const matrixText = document.getElementById('matrixText');
    const matrixScrollMode = document.getElementById('matrixScrollMode');
    const matrixScrollSpeed = document.getElementById('matrixScrollSpeed');
    const matrixScrollSpeedVal = document.getElementById('matrixScrollSpeedVal');
    const matrixScrollDirection = document.getElementById('matrixScrollDirection');
    const segmentsPanel = document.getElementById('segmentsPanel');
    const segmentsList = document.getElementById('segmentsList');
    const addSegment = document.getElementById('addSegment');
    const recoverRow = document.getElementById('recoverRow');
    const recoverBtn = document.getElementById('recoverBtn');
    const wifiSsid = document.getElementById('wifiSsid');
    const wifiPass = document.getElementById('wifiPass');

