igorhmc/yd-esp32-23/src/main.cpp
    let colorTimer = null;
    let brightTimer = null;
    let scrollTimer = null;
    let uiInitialized = false;

    function toggleScrollMode() {
      segmentsPanel.style.display = matrixScrollMode.value === 'multi' ? 'block' : 'none';
    }

    function addSegmentRow(text = '', color = '#FF0000') {
      const row = document.createElement('div');
      row.className = 'row';
      row.dataset.segmentRow = '1';
      row.innerHTML =
        `<input class="segText" type="text" maxlength="24" placeholder="Word or phrase" value="${text.replace(/"/g, '&quot;')}" style="flex:1;min-width:160px;padding:8px;border-radius:8px;border:1px solid #2b3a55;background:#0f1729;color:#e6edf7;">` +
        `<input class="segColor" type="color" value="${color}" style="width:56px;height:38px;border:0;background:none;padding:0;cursor:pointer;">` +
        `<button class="segRemove" type="button">Remove</button>`;

      row.querySelector('.segRemove').addEventListener('click', () => {
        row.remove();
      });

      segmentsList.appendChild(row);
    }

    function collectSegmentsPayload() {
      const rows = Array.from(segmentsList.querySelectorAll('[data-segment-row]'));
      const parts = [];

      rows.forEach(row => {
        const textEl = row.querySelector('.segText');
        const colorEl = row.querySelector('.segColor');
        const text = (textEl.value || '').replace(/[|:]/g, ' ');
        const color = colorEl.value || '#FFFFFF';
        if (text.length > 0) {
          parts.push(`${color}:${text}`);
        }
      });

      return parts.join('|');
    }

    async function fetchState() {
      const res = await fetch('/api/state');
      const st = await res.json();
      picker.value = st.hex;
      dot.style.background = st.hex;
      brightness.value = st.matrix_brightness;
      brightnessVal.textContent = st.matrix_brightness;
      if (document.activeElement !== matrixPins) {
        matrixPins.value = (st.matrix_pins || String(st.matrix_pin || ''));
      }
      matrixActiveOutputs.max = String(st.matrix_outputs || 1);
      if (document.activeElement !== matrixActiveOutputs) {
        matrixActiveOutputs.value = String(st.matrix_active_outputs || 1);
      }
      matrixScan.value = st.matrix_scan || 'column';
      matrixFlipX.checked = !!st.matrix_x_flip;
      matrixFlipY.checked = !!st.matrix_y_flip;
      if (document.activeElement !== matrixCounts) {
        matrixCounts.value = st.matrix_counts || '';
      }
      if (document.activeElement !== matrixText) {
        matrixText.value = st.matrix_scroll_text || '';
      }
      if (!uiInitialized) {
        matrixScrollMode.value = st.matrix_scroll_multicolor ? 'multi' : 'single';
        if (matrixScrollMode.value === 'multi' && segmentsList.children.length === 0) {
          addSegmentRow('', '#FF0000');
        }
        toggleScrollMode();
        uiInitialized = true;
      }
      matrixScrollSpeed.value = st.matrix_scroll_speed;
      matrixScrollSpeedVal.textContent = st.matrix_scroll_speed;
      matrixScrollDirection.value = st.matrix_scroll_direction || 'left';
      recoverRow.style.display = st.safe_mode ? 'flex' : 'none';
      wifiSsid.value = st.wifi_ssid || '';
      const safePrefix = st.safe_mode
        ? `SAFE MODE (${st.safe_reason || 'unstable boot'}, attempts=${st.boot_attempts}) | `
        : '';
      statusEl.textContent =
        safePrefix + `STA IP: ${st.ip} | Wi-Fi: ${st.wifi} | AP: ${st.ap_mode ? (st.ap_ssid + ' @ ' + st.ap_ip) : 'off'} | DNS: http://${st.hostname}.local | Color: ${st.hex} | Matrix: ${st.matrix_count}/${st.matrix_max_count} LEDs, width=${st.matrix_width}, outputs=${st.matrix_active_outputs || 1}/${st.matrix_outputs || 1} [pins=${st.matrix_pins || st.matrix_pin}] [counts=${st.matrix_counts || '-'}] (${st.matrix_scan || 'column'} map, flipX=${st.matrix_x_flip ? 1 : 0}, flipY=${st.matrix_y_flip ? 1 : 0}) | Brightness: ${st.matrix_brightness} | Scroll: ${st.matrix_scroll ? ('on "' + (st.matrix_scroll_text || '') + '" @ ' + st.matrix_scroll_speed + ' ms / ' + (st.matrix_scroll_direction || 'left') + (st.matrix_scroll_multicolor ? ' / multicolor' : ' / single')) : 'off'}`;
    }

    async function sendColor(hex) {
      await fetch('/api/led?hex=' + encodeURIComponent(hex));
      fetchState();
    }

    async function setMatrixBrightness(value) {
      await fetch('/api/matrix?brightness=' + encodeURIComponent(value));
      fetchState();
    }

    async function setMatrixPins(value) {
      const pins = (value || '').trim();
      if (!pins) {
        alert('Type the GPIO list in CSV format, e.g. 14,13');
        return;
      }
      const res = await fetch('/api/matrix?pins=' + encodeURIComponent(pins));
      const data = await res.json();
      if (!res.ok) {
        alert(data.error || 'Failed to apply matrix pins');
      }
      fetchState();
    }

    async function setMatrixActiveOutputs(value) {
      const outputs = parseInt(value, 10);
      if (Number.isNaN(outputs) || outputs < 1) {
        alert('Invalid number of active outputs');
        return;
      }
      const res = await fetch('/api/matrix?active_outputs=' + encodeURIComponent(outputs));
      const data = await res.json();
      if (!res.ok) {
        alert(data.error || 'Failed to apply active outputs');
      }
      fetchState();
    }

    async function setMatrixScan(value) {
      const mode = (value || '').trim();
      const res = await fetch('/api/matrix?map=' + encodeURIComponent(mode));
      const data = await res.json();
      if (!res.ok) {
        alert(data.error || 'Failed to apply matrix mapping');
      }
      fetchState();
    }

    async function setMatrixFlips() {
      const x = matrixFlipX.checked ? 1 : 0;
      const y = matrixFlipY.checked ? 1 : 0;
      const res = await fetch('/api/matrix?xflip=' + encodeURIComponent(x) + '&yflip=' + encodeURIComponent(y));
      const data = await res.json();
      if (!res.ok) {
        alert(data.error || 'Failed to apply matrix mirror');
      }
      fetchState();
    }

    async function setMatrixCounts(value) {
      const counts = (value || '').trim();
      if (!counts) {
        alert('Type CSV per output: plain totals (64,256) or modules (1x64+2x256,256)');
        return;
      }
      const res = await fetch('/api/matrix?counts=' + encodeURIComponent(counts));
      const data = await res.json();
      if (!res.ok) {
        alert(data.error || 'Failed to apply LED counts');
      }
      fetchState();
    }

