igorhmc/yd-esp32-23/src/main.cpp
    async function setScrollSpeed(value) {
      const speed = parseInt(value, 10);
      if (Number.isNaN(speed)) {
        return;
      }
      await fetch('/api/matrix?scroll_speed=' + encodeURIComponent(speed));
      fetchState();
    }

    async function setScrollDirection(value) {
      await fetch('/api/matrix?scroll_dir=' + encodeURIComponent(value));
      fetchState();
    }

    async function startScroll() {
      const speed = parseInt(matrixScrollSpeed.value, 10);
      const dir = matrixScrollDirection.value;
      let query = '/api/matrix?scroll=1&scroll_speed=' + encodeURIComponent(speed) + '&scroll_dir=' + encodeURIComponent(dir);

      if (matrixScrollMode.value === 'multi') {
        const segments = collectSegmentsPayload();
        if (!segments) {
          alert('Add at least one colored word or phrase.');
          return;
        }
        query += '&segments=' + encodeURIComponent(segments);
      } else {
        const text = matrixText.value;
        if (!text.trim()) {
          alert('Type a message first.');
          return;
        }
        query += '&text=' + encodeURIComponent(text);
      }

      const res = await fetch(query);
      const data = await res.json();
      if (!res.ok) {
        alert(data.error || 'Failed to start text scroll');
      }
      fetchState();
    }

    async function stopScroll() {
      const res = await fetch('/api/matrix?scroll=0');
      const data = await res.json();
      if (!res.ok) {
        alert(data.error || 'Failed to stop text scroll');
      }
      fetchState();
    }

    picker.addEventListener('input', () => {
      clearTimeout(colorTimer);
      colorTimer = setTimeout(() => sendColor(picker.value), 120);
    });

    brightness.addEventListener('input', () => {
      brightnessVal.textContent = brightness.value;
      clearTimeout(brightTimer);
      brightTimer = setTimeout(() => setMatrixBrightness(brightness.value), 120);
    });

    matrixScrollSpeed.addEventListener('input', () => {
      matrixScrollSpeedVal.textContent = matrixScrollSpeed.value;
      clearTimeout(scrollTimer);
      scrollTimer = setTimeout(() => setScrollSpeed(matrixScrollSpeed.value), 120);
    });

    matrixScrollDirection.addEventListener('change', async () => {
      await setScrollDirection(matrixScrollDirection.value);
    });

    matrixScrollMode.addEventListener('change', () => {
      toggleScrollMode();
      if (matrixScrollMode.value === 'multi' && segmentsList.children.length === 0) {
        addSegmentRow('', '#FF0000');
      }
    });

    addSegment.addEventListener('click', () => {
      addSegmentRow('', '#00FF00');
    });

    document.querySelectorAll('button[data-color]').forEach(btn => {
      btn.addEventListener('click', () => sendColor(btn.dataset.color));
    });

    document.getElementById('off').addEventListener('click', () => sendColor('#000000'));

    document.getElementById('matrixTest').addEventListener('click', async () => {
      await fetch('/api/matrix?test=1');
      fetchState();
    });

    matrixCountsApply.addEventListener('click', async () => {
      await setMatrixCounts(matrixCounts.value);
    });

    matrixCounts.addEventListener('keydown', async ev => {
      if (ev.key === 'Enter') {
        ev.preventDefault();
        await setMatrixCounts(matrixCounts.value);
      }
    });

    matrixPinsApply.addEventListener('click', async () => {
      await setMatrixPins(matrixPins.value);
    });

    matrixPins.addEventListener('keydown', async ev => {
      if (ev.key === 'Enter') {
        ev.preventDefault();
        await setMatrixPins(matrixPins.value);
      }
    });

    matrixActiveOutputsApply.addEventListener('click', async () => {
      await setMatrixActiveOutputs(matrixActiveOutputs.value);
    });

    matrixActiveOutputs.addEventListener('keydown', async ev => {
      if (ev.key === 'Enter') {
        ev.preventDefault();
        await setMatrixActiveOutputs(matrixActiveOutputs.value);
      }
    });

    matrixScan.addEventListener('change', async () => {
      await setMatrixScan(matrixScan.value);
    });

    matrixFlipX.addEventListener('change', async () => {
      await setMatrixFlips();
    });

    matrixFlipY.addEventListener('change', async () => {
      await setMatrixFlips();
    });

    document.getElementById('matrixTextStart').addEventListener('click', async () => {
      await startScroll();
    });

    document.getElementById('matrixTextStop').addEventListener('click', async () => {
      await stopScroll();
    });

    document.getElementById('wifiSave').addEventListener('click', async () => {
      const ssid = wifiSsid.value.trim();
      const pass = wifiPass.value;
      if (!ssid) {
        alert('Please provide an SSID.');
        return;
      }
      statusEl.textContent = 'Connecting to Wi-Fi...';
      const res = await fetch('/api/wifi?ssid=' + encodeURIComponent(ssid) + '&password=' + encodeURIComponent(pass) + '&save=1');
      const data = await res.json();
      if (!res.ok) {
        alert(data.error || 'Failed to configure Wi-Fi');
      }
      fetchState();
    });

    document.getElementById('wifiForget').addEventListener('click', async () => {
      const res = await fetch('/api/wifi?forget=1');
      const data = await res.json();
      if (!res.ok) {
        alert(data.error || 'Failed to forget Wi-Fi');
      }
      fetchState();
    });

    document.getElementById('otaUpload').addEventListener('click', async () => {
      const fileInput = document.getElementById('otaFile');
      if (!fileInput.files || fileInput.files.length === 0) {
        alert('Select a .bin file');
        return;
      }

      const form = new FormData();
      form.append('firmware', fileInput.files[0]);
      statusEl.textContent = 'Uploading OTA firmware...';

      const res = await fetch('/api/update', { method: 'POST', body: form });
      let data = {};
      try { data = await res.json(); } catch (_) {}
      if (!res.ok) {
        alert(data.error || 'OTA failed');
        statusEl.textContent = 'OTA failed';
        return;
      }
      statusEl.textContent = 'OTA complete. Rebooting ESP...';
    });

    recoverBtn.addEventListener('click', async () => {
      statusEl.textContent = 'Clearing safe mode and rebooting...';
      await fetch('/api/recover');
    });

