igorhmc/yd-esp32-23/src/main.cpp
    fetchState();
    setInterval(fetchState, 2000);
  </script>
</body>
</html>
)HTML";
  gWebServer.send_P(200, "text/html; charset=utf-8", kHtml);
}

void handleApiState() {
  gWebServer.send(200, "application/json", buildStateJson());
}

void handleApiRecover() {
  clearBootGuard();
  gRecoveryBootToken = kRecoveryBootMagic;
  gSafeMode = false;
  gSafeModeReason = "";
  gWebServer.send(200, "application/json", "{\"ok\":true,\"message\":\"restarting\"}");
  delay(300);
  ESP.restart();
}

void handleApiWifi() {
  if (gWebServer.hasArg("forget") && gWebServer.arg("forget") != "0") {
    clearWifiSettings();
    WiFi.disconnect(true, true);
    startConfigAp();
    gMdnsStarted = false;
    gWebServer.send(200, "application/json", "{\"ok\":true,\"forgot\":true}");
    return;
  }

  if (!gWebServer.hasArg("ssid")) {
    gWebServer.send(200, "application/json", buildStateJson());
    return;
  }

  const String ssid = gWebServer.arg("ssid");
  const String password = gWebServer.hasArg("password") ? gWebServer.arg("password") : "";
  const bool save = !gWebServer.hasArg("save") || gWebServer.arg("save") != "0";

  if (ssid.length() == 0) {
    gWebServer.send(400, "application/json", "{\"error\":\"ssid_empty\"}");
    return;
  }

  if (!gApMode) {
    startConfigAp();
  }

  if (!connectWifiWithCredentials(ssid, password, 20000)) {
    gWebServer.send(502, "application/json", "{\"error\":\"wifi_connect_failed\"}");
    return;
  }

  if (save) {
    saveWifiSettings(ssid, password);
  }

  if (!gMdnsStarted) {
    gMdnsStarted = startMdns();
  }

  stopConfigAp();
  gWebServer.send(200, "application/json", buildStateJson());
}

void handleApiUpdateFinished() {
  if (gOtaHasError || Update.hasError()) {
    gWebServer.send(500, "application/json", "{\"error\":\"ota_failed\"}");
    return;
  }

  gWebServer.send(200, "application/json", "{\"ok\":true,\"message\":\"restarting\"}");
  delay(300);
  ESP.restart();
}

void handleApiUpdateUpload() {
  HTTPUpload &upload = gWebServer.upload();
  if (upload.status == UPLOAD_FILE_START) {
    gOtaHasError = !Update.begin(UPDATE_SIZE_UNKNOWN, U_FLASH);
  } else if (upload.status == UPLOAD_FILE_WRITE) {
    if (!gOtaHasError && Update.write(upload.buf, upload.currentSize) != upload.currentSize) {
      gOtaHasError = true;
    }
  } else if (upload.status == UPLOAD_FILE_END) {
    if (!gOtaHasError) {
      gOtaHasError = !Update.end(true);
    }
  } else if (upload.status == UPLOAD_FILE_ABORTED) {
    gOtaHasError = true;
    Update.abort();
  }
}

void handleApiLed() {
  RgbColor next = gLedColor;
  bool changed = false;

  if (gWebServer.hasArg("hex")) {
    changed = parseHexColor(gWebServer.arg("hex"), next);
  } else if (gWebServer.hasArg("r") && gWebServer.hasArg("g") && gWebServer.hasArg("b")) {
    next.r = static_cast<uint8_t>(constrain(gWebServer.arg("r").toInt(), 0, 255));
    next.g = static_cast<uint8_t>(constrain(gWebServer.arg("g").toInt(), 0, 255));
    next.b = static_cast<uint8_t>(constrain(gWebServer.arg("b").toInt(), 0, 255));
    changed = true;
  }

  if (!changed) {
    gWebServer.send(400, "application/json", "{\"error\":\"invalid_color\"}");
    return;
  }

  setLedColor(next.r, next.g, next.b);
  saveSettings();
  gWebServer.send(200, "application/json", buildStateJson());
}

void handleApiMatrix() {
  if (gSafeMode) {
    gWebServer.send(503, "application/json", "{\"error\":\"safe_mode_active\"}");
    return;
  }

  bool changed = false;
  bool savePersistentSettings = false;

  if (gWebServer.hasArg("brightness")) {
    const int br = constrain(gWebServer.arg("brightness").toInt(), 0, 255);
    setMatrixBrightness(static_cast<uint8_t>(br));
    changed = true;
    savePersistentSettings = true;
  }

  if (gWebServer.hasArg("test")) {
    if (gWebServer.arg("test") != "0") {
      startMatrixTest();
    }
    changed = true;
  }

  if (gWebServer.hasArg("hex")) {
    RgbColor next = gLedColor;
    if (!parseHexColor(gWebServer.arg("hex"), next)) {
      gWebServer.send(400, "application/json", "{\"error\":\"invalid_color\"}");
      return;
    }
    setLedColor(next.r, next.g, next.b);
    changed = true;
    savePersistentSettings = true;
  }

  if (gWebServer.hasArg("scroll_speed")) {
    String speedArg = gWebServer.arg("scroll_speed");
    speedArg.trim();
    char *endPtr = nullptr;
    const long speedVal = strtol(speedArg.c_str(), &endPtr, 10);
    if (endPtr == speedArg.c_str() || endPtr == nullptr || *endPtr != '\0') {
      gWebServer.send(400, "application/json", "{\"error\":\"invalid_scroll_speed\"}");
      return;
    }

    gMatrixScrollStepMs = static_cast<uint16_t>(constrain(static_cast<int>(speedVal), 40, 1000));
    if (gMatrixScrollRunning) {
      gMatrixScrollLastStepMs = millis();
      renderMatrixScrollFrame();
    }
    changed = true;
  }

  if (gWebServer.hasArg("scroll_dir")) {
    ScrollDirection nextDirection = gMatrixScrollDirection;
    if (!parseScrollDirection(gWebServer.arg("scroll_dir"), nextDirection)) {
      gWebServer.send(400, "application/json", "{\"error\":\"invalid_scroll_direction\"}");
      return;
    }

    if (nextDirection != gMatrixScrollDirection) {
      gMatrixScrollDirection = nextDirection;
      if (gMatrixScrollRunning) {
        gMatrixScrollOffsetX = scrollStartOffsetX(gMatrixScrollDirection, gMatrixScrollText);
        gMatrixScrollLastStepMs = millis();
        renderMatrixScrollFrame();
      }
      savePersistentSettings = true;
    }
    changed = true;
  }

  if (gWebServer.hasArg("map")) {
    MatrixScanOrder nextOrder = gMatrixScanOrder;
    if (!parseMatrixScanOrder(gWebServer.arg("map"), nextOrder)) {
      gWebServer.send(400, "application/json", "{\"error\":\"invalid_matrix_map\"}");
      return;
    }
    if (nextOrder != gMatrixScanOrder) {
      applyMatrixScanOrder(nextOrder);
      savePersistentSettings = true;
    }
    changed = true;
  }

  if (gWebServer.hasArg("xflip") || gWebServer.hasArg("yflip")) {
    bool nextXFlip = gMatrixXFlip;
    bool nextYFlip = gMatrixYFlip;

    if (gWebServer.hasArg("xflip") && !parseBoolArg(gWebServer.arg("xflip"), nextXFlip)) {
      gWebServer.send(400, "application/json", "{\"error\":\"invalid_xflip\"}");
      return;
    }
    if (gWebServer.hasArg("yflip") && !parseBoolArg(gWebServer.arg("yflip"), nextYFlip)) {
      gWebServer.send(400, "application/json", "{\"error\":\"invalid_yflip\"}");
      return;
    }

    if (nextXFlip != gMatrixXFlip || nextYFlip != gMatrixYFlip) {
      applyMatrixFlips(nextXFlip, nextYFlip);
      savePersistentSettings = true;
    }
    changed = true;
  }

  if (gWebServer.hasArg("active_outputs")) {
    String outputsArg = gWebServer.arg("active_outputs");
    outputsArg.trim();
    char *endPtr = nullptr;
    const long outputsVal = strtol(outputsArg.c_str(), &endPtr, 10);
    if (endPtr == outputsArg.c_str() || endPtr == nullptr || *endPtr != '\0') {
      gWebServer.send(400, "application/json", "{\"error\":\"invalid_active_outputs\"}");
      return;
    }
    if (outputsVal < 1 || outputsVal > MATRIX_OUTPUT_COUNT) {
      gWebServer.send(400, "application/json", "{\"error\":\"active_outputs_out_of_range\"}");
      return;
    }

    String outputsError;
    if (!applyMatrixActiveOutputs(static_cast<uint8_t>(outputsVal), outputsError)) {
      if (outputsError.length() == 0) {
        outputsError = "matrix_active_outputs_apply_failed";
      }
      gWebServer.send(500, "application/json", "{\"error\":\"" + outputsError + "\"}");
      return;
    }
    changed = true;
    savePersistentSettings = true;
  }

  if (gWebServer.hasArg("pins")) {
    uint8_t nextPins[MATRIX_OUTPUT_COUNT] = {0};
    String pinError;
    if (!parseMatrixPinsCsv(gWebServer.arg("pins"), gMatrixActiveOutputs, nextPins, pinError)) {
      gWebServer.send(400, "application/json", "{\"error\":\"" + pinError + "\"}");
      return;
    }

    if (!applyMatrixPins(nextPins)) {
      gWebServer.send(500, "application/json", "{\"error\":\"matrix_pin_apply_failed\"}");
      return;
    }
    changed = true;
    savePersistentSettings = true;
  } else if (gWebServer.hasArg("pin")) {
    String pinArg = gWebServer.arg("pin");
    pinArg.trim();
    char *endPtr = nullptr;
    const long pinVal = strtol(pinArg.c_str(), &endPtr, 10);
    if (endPtr == pinArg.c_str() || endPtr == nullptr || *endPtr != '\0') {
      gWebServer.send(400, "application/json", "{\"error\":\"invalid_pin\"}");
      return;
    }
    if (!isValidMatrixPin(static_cast<int>(pinVal))) {
      gWebServer.send(400, "application/json", "{\"error\":\"pin_out_of_range\"}");
      return;
    }

    uint8_t nextPins[MATRIX_OUTPUT_COUNT] = {0};
    for (uint8_t i = 0; i < MATRIX_OUTPUT_COUNT; i++) {
      nextPins[i] = gMatrixPins[i];
    }
    nextPins[0] = static_cast<uint8_t>(pinVal);

