igorhmc/yd-esp32-23/src/main.cpp
    if (!matrixPinsAreUnique(nextPins, gMatrixActiveOutputs)) {
      gWebServer.send(400, "application/json", "{\"error\":\"duplicate_pins\"}");
      return;
    }

    if (!applyMatrixPins(nextPins)) {
      gWebServer.send(500, "application/json", "{\"error\":\"matrix_pin_apply_failed\"}");
      return;
    }
    changed = true;
    savePersistentSettings = true;
  }

  if (gWebServer.hasArg("counts")) {
    uint16_t nextCounts[MATRIX_OUTPUT_COUNT] = {0};
    String countsError;
    if (!parseMatrixCountsCsv(gWebServer.arg("counts"), gMatrixActiveOutputs, nextCounts, countsError)) {
      gWebServer.send(400, "application/json", "{\"error\":\"" + countsError + "\"}");
      return;
    }
    if (!matrixCountsAreValid(nextCounts, gMatrixActiveOutputs, countsError)) {
      gWebServer.send(400, "application/json", "{\"error\":\"" + countsError + "\"}");
      return;
    }

    if (!applyMatrixCounts(nextCounts)) {
      gWebServer.send(500, "application/json", "{\"error\":\"matrix_counts_apply_failed\"}");
      return;
    }
    changed = true;
    savePersistentSettings = true;
  } else if (gWebServer.hasArg("count")) {
    gWebServer.send(400, "application/json", "{\"error\":\"use_counts_csv\"}");
    return;
  }

  const bool hasTextArg = gWebServer.hasArg("text");
  const bool hasSegmentsArg = gWebServer.hasArg("segments");
  if (gWebServer.hasArg("scroll")) {
    if (gWebServer.arg("scroll") != "0") {
      if (hasSegmentsArg) {
        if (!startMatrixScrollSegments(gWebServer.arg("segments"), gMatrixScrollStepMs)) {
          gWebServer.send(400, "application/json", "{\"error\":\"invalid_segments\"}");
          return;
        }
      } else {
        const String text = hasTextArg ? gWebServer.arg("text") : gMatrixScrollText;
        if (!startMatrixScroll(text, gMatrixScrollStepMs)) {
          gWebServer.send(400, "application/json", "{\"error\":\"text_empty\"}");
          return;
        }
      }
    } else {
      stopMatrixScroll();
    }
    changed = true;
  } else if (hasSegmentsArg) {
    if (!startMatrixScrollSegments(gWebServer.arg("segments"), gMatrixScrollStepMs)) {
      gWebServer.send(400, "application/json", "{\"error\":\"invalid_segments\"}");
      return;
    }
    changed = true;
  } else if (hasTextArg) {
    if (!startMatrixScroll(gWebServer.arg("text"), gMatrixScrollStepMs)) {
      gWebServer.send(400, "application/json", "{\"error\":\"text_empty\"}");
      return;
    }
    changed = true;
  }

  if (!changed) {
    gWebServer.send(400, "application/json", "{\"error\":\"invalid_params\"}");
    return;
  }

  if (savePersistentSettings) {
    saveSettings();
  }

  gWebServer.send(200, "application/json", buildStateJson());
}

bool startWebServer() {
  gWebServer.on("/", HTTP_GET, handleRoot);
  gWebServer.on("/api/state", HTTP_GET, handleApiState);
  gWebServer.on("/api/recover", HTTP_GET, handleApiRecover);
  gWebServer.on("/api/led", HTTP_GET, handleApiLed);
  gWebServer.on("/api/matrix", HTTP_GET, handleApiMatrix);
  gWebServer.on("/api/wifi", HTTP_GET, handleApiWifi);
  gWebServer.on("/api/update", HTTP_POST, handleApiUpdateFinished, handleApiUpdateUpload);
  gWebServer.onNotFound([]() {
    gWebServer.send(404, "text/plain", "Not found");
  });
  gWebServer.begin();

  Serial.println("[OK] Web server started.");
  if (WiFi.isConnected()) {
    Serial.printf("Open: http://%s.local or http://%s\n",
                  DEVICE_HOSTNAME,
                  WiFi.localIP().toString().c_str());
  }
  if (gApMode) {
    Serial.printf("Config AP: SSID=%s password=%s URL=http://%s\n",
                  gApSsid.c_str(),
                  gApPassword.c_str(),
                  WiFi.softAPIP().toString().c_str());
  }
  return true;
}

}  // namespace

void setup() {
  Serial.begin(115200);
  delay(800);

  const esp_reset_reason_t resetReason = esp_reset_reason();
  const bool recoveryBoot = (gRecoveryBootToken == kRecoveryBootMagic);
  if (recoveryBoot) {
    gRecoveryBootToken = 0;
  }
  armBootGuard();
  Serial.printf("[BOOT] reset_reason=%s | boot_attempts=%u\n",
                resetReasonToString(resetReason),
                static_cast<unsigned>(gBootGuardAttempts));
  if (recoveryBoot) {
    Serial.println("[BOOT] Recovery boot requested (diagnostics skipped once).");
  }
  const bool criticalReset =
    (resetReason == ESP_RST_BROWNOUT ||
     resetReason == ESP_RST_PANIC ||
     resetReason == ESP_RST_WDT ||
     resetReason == ESP_RST_TASK_WDT ||
     resetReason == ESP_RST_INT_WDT);
  if (criticalReset ||
      (gBootGuardAttempts >= kBootGuardThreshold &&
       resetReason != ESP_RST_POWERON &&
       resetReason != ESP_RST_DEEPSLEEP)) {
    gSafeMode = true;
    gSafeModeReason = resetReasonToString(resetReason);
    Serial.printf("[SAFE] Entering safe mode (reason=%s, attempts=%u).\n",
                  gSafeModeReason.c_str(),
                  static_cast<unsigned>(gBootGuardAttempts));
  }

#ifdef LED_BUILTIN
  pinMode(kLedPin, OUTPUT);
#endif

  Serial.println();
  printSystemInfo();
  if (!gSafeMode && !recoveryBoot) {
    rgbTest();
    psramPatternTest();
    nvsCounterTest();
  } else {
    Serial.println("[SAFE] Diagnostic stress tests skipped.");
  }

  gMatrixRuntimeMaxLedCount = detectRuntimeMaxLedCount();
  loadDefaultMatrixCounts();
  String bootGeometryError;
  (void)rebuildMatrixGeometry(gMatrixLedsPerOutput, gMatrixActiveOutputs, bootGeometryError);
  Serial.printf("[OK] Automatic runtime LED limit: %u (compiled ceiling: %u)\n",
                static_cast<unsigned>(gMatrixRuntimeMaxLedCount),
                static_cast<unsigned>(kMatrixCompiledMaxLedCount));

  loadSettings();
  if (!gSafeMode) {
    if (initMatrix()) {
      applyMatrixSolidColor(gLedColor);
    } else {
      gSafeMode = true;
      gSafeModeReason = "matrix_init_failed";
      gMatrixReady = false;
      gMatrixTestRunning = false;
      gMatrixScrollRunning = false;
      Serial.println("[SAFE] Matrix init failed, entering safe mode.");
    }
  } else {
    gMatrixReady = false;
    gMatrixTestRunning = false;
    gMatrixScrollRunning = false;
    Serial.println("[SAFE] Matrix output disabled for recovery.");
  }

  if (connectConfiguredWifi()) {
    gMdnsStarted = startMdns();
    (void)gMdnsStarted;
  } else {
    startConfigAp();
  }

  gWebServerStarted = startWebServer();

  Serial.println("=== END DIAGNOSTICS ===");
}

void loop() {
  if (gWebServerStarted) {
    gWebServer.handleClient();
  }

  if (!gSafeMode) {
    tickMatrixScroll();
    tickMatrixTest();
  }

  static unsigned long lastPrint = 0;
  const unsigned long now = millis();
  if (!gSafeMode && !gBootMarkedStable && now >= kBootGuardStableMs) {
    clearBootGuard();
    gBootMarkedStable = true;
    Serial.println("[BOOT] Marked as stable, boot guard reset.");
  }

  if (now - lastPrint >= 3000) {
    lastPrint = now;
    Serial.printf(
      "Heartbeat | uptime=%lu ms | heap=%u | psram_free=%u | wifi=%d | ip=%s | led=%s | matrix_br=%u | matrix_test=%d | matrix_scroll=%d | scroll_dir=%s | safe_mode=%d\n",
      now,
      ESP.getFreeHeap(),
      ESP.getFreePsram(),
      static_cast<int>(WiFi.status()),
      WiFi.isConnected() ? WiFi.localIP().toString().c_str() : "0.0.0.0",
      ledHexColor().c_str(),
      gMatrixBrightness,
      gMatrixTestRunning ? 1 : 0,
      gMatrixScrollRunning ? 1 : 0,
      scrollDirectionToString(gMatrixScrollDirection),
      gSafeMode ? 1 : 0);
  }

  delay(10);
}
